[
  {
    "reviewerID": "A2GR89J5Q7OTWN",
    "asin": "B0007OWASE",
    "reviewerName": "Aditya Rajguru",
    "helpful": [
      1,
      2
    ],
    "reviewText": "I have purchased this drive for backing up data regularly. It has been very easy to do so with the bundled Nero software. Have not had a chance to use extensively.",
    "overall": 4.0,
    "summary": "Good and reliable",
    "unixReviewTime": 1184716800,
    "reviewTime": "07 18, 2007"
  },
  {
    "reviewerID": "A2RS5C7UH29Q2V",
    "asin": "B0007OWASE",
    "reviewerName": "alpinebob \"alpine bob\"",
    "helpful": [
      1,
      2
    ],
    "reviewText": "Great piece of machinery.  Worked super right out of the box. Software easy to work with for a computer challenged person like me.Eventhough the program did not jive with the supplied book and instructions. I would like to delete some functions like it says I can in the book but it is not possible. Overall it's a great product. Speedy delivery also",
    "overall": 4.0,
    "summary": "great recorder",
    "unixReviewTime": 1186272000,
    "reviewTime": "08 5, 2007"
  },
  {
    "reviewerID": "A11H4FFP7JJW9E",
    "asin": "B0007OWASE",
    "reviewerName": "Andrew S. Goldberg",
    "helpful": [
      6,
      18
    ],
    "reviewText": "Might be a good product, but my PC ran into problems when I tried to install software. Everthing seemed fine, then when the PC restarted, the system kept crashing. Finally, I had to remove the software and return the product. I think I'm going to buy a new computer with a DVD burner already installed. By the time I upgrade my PC to accept this external burner and factor in the $120 for the burner itself, I could spend a little more and have a new PC. Lesson: check the system requirements!",
    "overall": 1.0,
    "summary": "Crashed System",
    "unixReviewTime": 1151884800,
    "reviewTime": "07 3, 2006"
  },
  {
    "reviewerID": "A307UP7FT170KU",
    "asin": "B0007OWASE",
    "reviewerName": "A. RAWLING \"restorman\"",
    "helpful": [
      2,
      3
    ],
    "reviewText": "My system is an up to date Dell Dimension that only had ROM DVD and CDRdrive so I saw this unit that appeared to fill my needs  of for transfering some video shorts to DVD......I read the AMAZON PRODUCT DESCRIPTION  that stated ...\"comes with Nero Software THAT EASILY allows you TO BURN CDs and DVDS\".You can only burn CD Videos that will run on your (and others) computer.Data DVDs up to 4.7 GB - which is handy HOWEVER: It was not clear that in order to transfer any of your video files to real (run of mill DVD player type) DVDs you must upgrade to Nero 7 or  8 which is available for and extra $60...Be careful  if you want to make  \"real\" DVDs  go where  you can see thatNero 7 Essentials is included.... or upgrade to Nero 8....cause I don't believe you can get 7 any longer.Inexpensive  and VERY simple to get running....I did not need another DVD ROM or CD Burner at this time.I wish someone had illustrated this point... don't buy it unless you want it for Data DVD's (backups).",
    "overall": 1.0,
    "summary": "You Need Nero 7 or  8 in order to make DVD's",
    "unixReviewTime": 1198368000,
    "reviewTime": "12 23, 2007"
  },
  {
    "reviewerID": "A3SI0JYXB2VQET",
    "asin": "B0007OWASE",
    "reviewerName": "A. Taylor",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This burner took me a little getting used to, but now that I am, it works just great, with minimal sound when compared to other burners. Highly recommended.",
    "overall": 5.0,
    "summary": "Burns great DVDs",
    "unixReviewTime": 1202860800,
    "reviewTime": "02 13, 2008"
  },
  {
    "reviewerID": "A1MQNLSHWV9KIG",
    "asin": "B0007OWASE",
    "reviewerName": "A. Wagner",
    "helpful": [
      3,
      3
    ],
    "reviewText": "Arrived VERY timely, easy to work with.  Nero software is pretty intuitive, but pre-installs more software than is necessary, I think.  Drive runs well & quickly, fits nicely on the desk.  Runs a little loud/ vibrates hard when writing disks.  Still, decent buy and works well for my purposes.",
    "overall": 4.0,
    "summary": "Memorex DVD External Drive",
    "unixReviewTime": 1186876800,
    "reviewTime": "08 12, 2007"
  },
  {
    "reviewerID": "A28EQ5JQDXCT3G",
    "asin": "B0007OWASE",
    "reviewerName": "Balaji",
    "helpful": [
      22,
      36
    ],
    "reviewText": "This dvd drive is not compatible with USB1.1. I bought this in Officedepot for a good deal. The drive looked really nice with black/silver colorings. The stand is sturdy and can keep your drive vertically without any risk of falling.But after I bought this, I plugged it into my computer. I was really shocked with the performance as it read some dvd movies horribly which were properly read by my other dvd-rom drive (internal). I tested it by writing 1 GB of data into a DVD-R disc. It claims a complete DVD-R write(4.5 GB) would take only 6 minutes. But I had to wait for around 1/2 hr for the 1 GB to get written into the disc. It was damn slow. It's 1x not 16x. Then I started reading the manual and found it will work at 1x or sometimes won't work with USB1.1. Luckily, I returned it and got my money back.I dont know whether it is good for USB2.0, but I am sure it is not for people having only USB1.1; I am going now for an internal dvd-rw drive.",
    "overall": 2.0,
    "summary": "Beware if you have USB1.1",
    "unixReviewTime": 1138233600,
    "reviewTime": "01 26, 2006"
  },
  {
    "reviewerID": "A3SVGWM6KPOUXJ",
    "asin": "B0007OWASE",
    "reviewerName": "BlakeMiltonCraft \"Steven\"",
    "helpful": [
      2,
      3
    ],
    "reviewText": "This is reasonably good CD/DVD drive so far, hookup is simple, my system recognized it right away, the device is compact and very quiet, not bad looking either. CD recording is slow, however, the recordings are good quality and worth the wait. DVD recording is impossible, unless you have some sort of decryption and then it's questionable, thanks to the Nero software which I just refuse to have anythig to do with anymore. I so far like the drive, my major complaint is the Nero software that came with it, I've had nothing but aggravation with it! Nero has an expiration based upon when you install it and then the DVD function becomes extinct unless, you subscribe. Nero can also interfere with other applications such as shrink and hard drive storage,whereas it refuses to store and refuses to play. If you have other programs like Media Player & I Tunes, Shrink or Power DVD you'll find you're using them to run this drive, Shame on Nero for looking sharp & being nothing. Don't let this deter you. This is a pretty nice drive for the price and if you have other applications it should work just fine. I admit I'm still a novice though I expected more from the total package.I ordered this from Amazon & Tiger Direct, delivery was very prompt and well packaged.",
    "overall": 5.0,
    "summary": "Good External Drive for the Price",
    "unixReviewTime": 1168300800,
    "reviewTime": "01 9, 2007"
  },
  {
    "reviewerID": "A1NR59KNVO9QQY",
    "asin": "B0007OWASE",
    "reviewerName": "bob",
    "helpful": [
      5,
      10
    ],
    "reviewText": "When it first arrived, I plugged it into my usb 2 port.  Computer would not recognize it.  After trying everything I and google newsgroups could think of, I took it to work -- none of my work computers would recognize it either. Sent it back, got another one.  Plugged it in, the computer immediately recognized it.  Cool ... i thought. I turned it off, and shut down the for the night.  Next day, turned it on .... nothing!! Computer would not recognize it.  Took it to work, and the computer reported \"problem with usb device\"  Sent it back, got a refund, and I am going to get an internal (non-usb!!) drive.",
    "overall": 1.0,
    "summary": "Computers would not recognize it",
    "unixReviewTime": 1179360000,
    "reviewTime": "05 17, 2007"
  },
  {
    "reviewerID": "A1POGSPD4HN8Y1",
    "asin": "B0007OWASE",
    "reviewerName": "Cap'n Stoob \"Stoob\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This product doesn't seem to work any better or worse than its competitors, but keep in mind that you'll only really get the maximum burn speeds if you're using an internal or Firewire drive.  The USB connection limits the write speed, sometimes severely.  If you're plugged directly into the motherboard, you might get 8x out of it, but if you're in a hub or something, you'll probably go down to 4x.  If you're really in need of superfast burning, then I recommend that you clear a drive bay in your desktop and get an internal drive with a large buffer.  I can get 16x in my desktop (IDE) but only 4x max on this USB unit.Otherwise, the unit works just fine.",
    "overall": 3.0,
    "summary": "The USB Can Slow You Down",
    "unixReviewTime": 1169337600,
    "reviewTime": "01 21, 2007"
  },
  {
    "reviewerID": "ANWAAEU2JQBUX",
    "asin": "B0007OWASE",
    "reviewerName": "Carlos P. \"xfile\"",
    "helpful": [
      2,
      2
    ],
    "reviewText": "First i had sony dvd DL external recorder that was a total disaster, only works for two weeks and cost me US$130.  Then i decide to move to another one since my laptop doesn't write dvd DL.  I tried the memorex 3203288 that only cost me around US$80. and works perfectly, it's really fast and includes a firewire 400 port for a faster speed!  Includes a stand and all the cables.i strngly recomended for the price and quality that this product offer.",
    "overall": 5.0,
    "summary": "Really fast and reliable",
    "unixReviewTime": 1185667200,
    "reviewTime": "07 29, 2007"
  },
  {
    "reviewerID": "ANHOQEQUYECJL",
    "asin": "B0007OWASE",
    "reviewerName": "Casson A Wilson IV \"Casey\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I didn't do a whole lot of research on what was the cheapest or had the best reviews before buying this, but I can tell you it does the trick.  Using this along with programs such as DVD Shrink and Nero allows me to copy basically any movie I'd like fairly quickly.  Some DVD's have structures that can not be copied but most are easy enough.",
    "overall": 5.0,
    "summary": "Excellent Choice",
    "unixReviewTime": 1179360000,
    "reviewTime": "05 17, 2007"
  },
  {
    "reviewerID": "A7KUEHIOIEGJT",
    "asin": "B0007OWASE",
    "reviewerName": "Chad A. Campbell",
    "helpful": [
      0,
      3
    ],
    "reviewText": "I had the same problem as another reviewer where it would recognize the drive one time and then it never did again.",
    "overall": 1.0,
    "summary": "Same problem as other reviewers",
    "unixReviewTime": 1185580800,
    "reviewTime": "07 28, 2007"
  },
  {
    "reviewerID": "A17VSEOFLMY3IS",
    "asin": "B0007OWASE",
    "reviewerName": "Charles Mcmullen \"chasman\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "It took some time to configure things with my computer but seems to work well and does the job.  I have installed some new software \"Nero\" to the unit and have had little difficulty.  Price is OK.",
    "overall": 4.0,
    "summary": "Memorex DVD Double Layer Recorder 16 x 16",
    "unixReviewTime": 1200528000,
    "reviewTime": "01 17, 2008"
  },
  {
    "reviewerID": "AOTU4ZC76W7R3",
    "asin": "B0007OWASE",
    "reviewerName": "Charles W. Muser",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The burner was easy to install, and is easy to use, and does the job the sales literature said it would.  As usual though, the manual isn't worth much, but that's the case with most manuals.",
    "overall": 5.0,
    "summary": "It works the way they said it would",
    "unixReviewTime": 1179100800,
    "reviewTime": "05 14, 2007"
  },
  {
    "reviewerID": "A3A3LFPJW4Y1PS",
    "asin": "B0007OWASE",
    "reviewerName": "Chris Gulick",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Ive had this product for about 4-5 months now, it worked okay at the beginning of it's life, had a couple writing errors that were troubleshooted to be a malfunction in the drives writing process, wasn't too pleased with that. Now, 5 months later, i cant burn more than 5 MB of data to a disk without the drive freezing up and spitting out an error or 10. So unless i want to burn 5 MB of a 600 MB file at a time, it's been rendered useless to me.Looked around online and it appears I'm not the only one who has had this type of issue with this product.",
    "overall": 2.0,
    "summary": "Cheap",
    "unixReviewTime": 1235865600,
    "reviewTime": "03 1, 2009"
  },
  {
    "reviewerID": "AQHX4ICJYYR7Z",
    "asin": "B0007OWASE",
    "reviewerName": "Chris Moore",
    "helpful": [
      4,
      4
    ],
    "reviewText": "This product is excellent. I wanted a replacement as the DVD burner on my Dell PC doesn't want to work anymore. I have tried 4 brands of dvd discs, + and - formats, and they have all come out very well from this machine.I am very pleased with this purchase!!",
    "overall": 5.0,
    "summary": "Very Good Value",
    "unixReviewTime": 1188259200,
    "reviewTime": "08 28, 2007"
  },
  {
    "reviewerID": "AO2OWZVAAQJHX",
    "asin": "B0007OWASE",
    "reviewerName": "C. Ratkowski",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Sets right up, and works great! A good buy for the portable capability it gives you!",
    "overall": 5.0,
    "summary": "good buy!",
    "unixReviewTime": 1191801600,
    "reviewTime": "10 8, 2007"
  },
  {
    "reviewerID": "A316SWVD2O3SAT",
    "asin": "B0007OWASE",
    "reviewerName": "David M. Wilks \"Thunder1\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Drive works okay but makes a horrible noise in the vertical position.  If this is important choose another drive.  Packaged software is poor.  Don't load Nero unless you have used and like it.  InCd created some problems, and I rely on the Microsoft writing software which is cumbersome, but works.",
    "overall": 4.0,
    "summary": "Dependable drive",
    "unixReviewTime": 1179187200,
    "reviewTime": "05 15, 2007"
  },
  {
    "reviewerID": "A222G3NH3TNSPI",
    "asin": "B0007OWASE",
    "reviewerName": "David Snyder",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Its not that bad of a burner but you need to use the firewire cable and not the usb 2 cable because i can only get 12x of the 16x with the usb 2.  Also don't use the vertical stand, i had problems with it wanting to burn vertically but it would read just fine vertically, so i use it horizontally now.  Those are the 2 reason why I gave this 4 stars and not 5 stars.  But i plan on buying another one of these in the next couple days.",
    "overall": 4.0,
    "summary": "Pretty Good",
    "unixReviewTime": 1171670400,
    "reviewTime": "02 17, 2007"
  },
  {
    "reviewerID": "A178KB8AGLRUVA",
    "asin": "B0007OWASE",
    "reviewerName": "D. Blackman",
    "helpful": [
      2,
      2
    ],
    "reviewText": "I purchased this product for my daughter as she needed a DVD recorder to burn her different video projects. She absolutely loves it. Easy to use, wonderful in that the drive takes different DVD formats. Portable from one computer to the next. A must have. Highly recommend.",
    "overall": 5.0,
    "summary": "Memorex 30223288 DVD Double-Layer Recorder",
    "unixReviewTime": 1176249600,
    "reviewTime": "04 11, 2007"
  },
  {
    "reviewerID": "AYFV6SJSU92H4",
    "asin": "B0007OWASE",
    "reviewerName": "Diana Brown",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Looking at the picture of the product posted, I thought I was getting the 'complete' box, not so.  No instructions, no software.",
    "overall": 4.0,
    "summary": "All in all - good",
    "unixReviewTime": 1179014400,
    "reviewTime": "05 13, 2007"
  },
  {
    "reviewerID": "A3HCGIZ21BPG10",
    "asin": "B0007OWASE",
    "reviewerName": "DMC Beat",
    "helpful": [
      1,
      1
    ],
    "reviewText": "What can I say but, this burner performs great.  I hooked it up in a matter of minutes to my Firewire port and copied my first DVD on the fly in 12 min. 48 seconds.  The copy played flawlessly.  The price, performance and ease of use make this a 5 star burner.I think other bad reviews didn't need a dvd burner so much as a PC upgrade.  You've gotta have a system that is up to the task.  I run an Amd Athalon64 X2 4200+, 2.5Gb memory, ATI X800XL 256mb video, Sound Blaster X-Fi Xtreme Gamer Fatal1ty Pro, and 250Gb hard drive internal and 280Gb Western Digital external hard drive.  My machine has 2 Firewire ports, 6 usb 2.0 ports and memory card reader.My internal DVD burner with light scribe decided to not burn DVD's any longer but, could still play them and burn CD's so I decided to keep it and get a second external burner.  I am so glad I made this choice!",
    "overall": 5.0,
    "summary": "This Burner is the ONE to get!",
    "unixReviewTime": 1172534400,
    "reviewTime": "02 27, 2007"
  },
  {
    "reviewerID": "A2C8UHTGG0CY55",
    "asin": "B0007OWASE",
    "reviewerName": "E. G. Guerra",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This is a GREAT product! ANY external DVD recorder is hard to find! To find that one that works is even harder. My DVD recorder drive that came with my computer broke, and then had to have a relative install another DVD recorder for me. However, for some reason the recorder my relative installed only recorded on DVD formats, so to make CD's or save stuff to CD, I had to buy another CD burner. I try not to EVER buy internal drives because it costs money to have someone install it for you, you have to be away from your computer for a long time, and also, you don't know if they'll really install it for you properly, and also could break something in the process of installing and not fix what they broke. So I went to circuit city and luckily there was ONE DVD/CD recorder that was external. It was the only one that was external there and it was USB connected, it was the one I am reviewing except it is a weaker version as mine goes up to 20x opposed to 48x. It is made from the same company Memorex. I'm SO happy with my purchase! I can make CD's again and make value and worth out of my computer again! Mine also has supposed lightscribe capablitity, but I wouldn't recommend trying that for newbies. That might be how my HP dvd burner broke. I also recommned DVD+R's opposed to DVD-R's.",
    "overall": 5.0,
    "summary": "Great REAL DVD recorder!",
    "unixReviewTime": 1232409600,
    "reviewTime": "01 20, 2009"
  },
  {
    "reviewerID": "A2OXXG2KIRE7XZ",
    "asin": "B0007OWASE",
    "reviewerName": "Ercole Marsili \"Ercole\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I recently purchased this item, after spending frustrating hours trying to make a simple Audio CD. I have been using computers for many years and I know pretty well when a product performs well. This is not exception. The bundled software is GREAT!Go for it!You'll like it, just like the other thousands of people who already own it.",
    "overall": 5.0,
    "summary": "Memorex has really pleased me.",
    "unixReviewTime": 1181174400,
    "reviewTime": "06 7, 2007"
  },
  {
    "reviewerID": "A4NKGU8QRDMKM",
    "asin": "B0007OWASE",
    "reviewerName": "George D.",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I would definitely give this product 5 starts but the level of noise it produce during work seems slightly excessive. Otherwise works as expected.",
    "overall": 4.0,
    "summary": "Solid product but a bit noisy",
    "unixReviewTime": 1181520000,
    "reviewTime": "06 11, 2007"
  },
  {
    "reviewerID": "AHF8SQZ34XAPH",
    "asin": "B0007OWASE",
    "reviewerName": "Gloria J. Duncan",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This computer-challenged granny hooked this unit up to my Dell in less than 5 minutes, then painlessly installed the software, and burned my firt DVD all by myself!  Sigh.  The unit is NOT flimsy and makes no noise at all. The instruction booklet is written in real English and is easy to understand.  It took about 45 minutes to make a back-up copy of a full length movie. I have no idea what all the techno-speak was about in the other reviews.  I just basically did a \"plug and play\" and I'm thrilled.",
    "overall": 5.0,
    "summary": "Hooray for Memorex!",
    "unixReviewTime": 1196294400,
    "reviewTime": "11 29, 2007"
  },
  {
    "reviewerID": "AELMSMXS6M634",
    "asin": "B0007OWASE",
    "reviewerName": "G. Thompson",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I have this product and let me tell you it does not take 2 hours NOR even 1 hour.the whole copy and burn process takes 30 mins or less.",
    "overall": 5.0,
    "summary": "Very dependable and easy to use",
    "unixReviewTime": 1209081600,
    "reviewTime": "04 25, 2008"
  },
  {
    "reviewerID": "A2A5NGIXKH75C7",
    "asin": "B0007OWASE",
    "reviewerName": "Hank Rutherford Hill",
    "helpful": [
      3,
      4
    ],
    "reviewText": "Short synopsis: Installed software, following instructions to the letter. Loaded in DVD, then tried to begin burning simple data DVD (pictures I've taken; nothing DRM'd or anything like that). The burner insists on trying to record a CD, even though there's a DVD in the drive, then spits out DVD and refuses to go any farther. Nero insists on loading a Microsoft-huge software package that won't work, and then provides horrible documentation. Stay far, far away from this product.",
    "overall": 1.0,
    "summary": "Horrible, horrible product",
    "unixReviewTime": 1186358400,
    "reviewTime": "08 6, 2007"
  },
  {
    "reviewerID": "A3V5AOPS6S9GVZ",
    "asin": "B0007OWASE",
    "reviewerName": "Harlen Bayha",
    "helpful": [
      1,
      2
    ],
    "reviewText": "Burns more coasters than a London pub.  Most disc types will be unreadable on other DVD players.  Junk.  I am returning mine, but have yet to receive my replacement.",
    "overall": 1.0,
    "summary": "Horrible Burner",
    "unixReviewTime": 1199664000,
    "reviewTime": "01 7, 2008"
  },
  {
    "reviewerID": "A1HLSLHVN768ER",
    "asin": "B0007OWASE",
    "reviewerName": "Heavy Metal Fan",
    "helpful": [
      17,
      18
    ],
    "reviewText": "This Memorex Double Layer DVD Burner is an amzing buy and makes burning all types of things extremely easy. As many people have pointed out, this drive is very slow if you use USB 1.1. If you have USB 1.1 the drive will still work, but very slowly. USB 2.0 is not much better if you ask me. My IE Firewire ports were taken up by scanners and printers so I ended up buying a Firewire Card (this is quite simple to install, you have to be retarded not to be able to figure this out). Firewire is the way Memorex intended this burner to be operated on. Before, USB took anywhere from 8-12 minutes to burn a CD and upwards of 40 minutes to burn slightly less than 10 minutes of DVD Video. After using the Firewire Card a CD takes less than 2(!) and never has buffer underrun errors (no more wasted discs). Where this drive really shines is with DVD. I took an illegaly copied copy of \"Doom\" (the movie, 112 minutes), recoded the video files into MPEG-4 (using the supplied Nero 6 software) and then burned the entire movie in 6.5 minutes!!!!! That's 4.4 GB of video (ultra high quality) in less than ten minutes!!! Amazing. The NeroRecode is great for making the MPEG-4 video files which can then be watched on the Video iPODS. Brilliant. Now for Nero. Yes, Nero 7 Ultra Edition is out, but the supplied Nero 6 burning suite is included with this burner, and does a very good job. It is very easy to use, and is customizable and does every type of project imaginable (Data, Audio, Data+Audio, Video, Video CD, Picture, plus ones I don't remember and will never use!) and recognizes every disc type. The included editing software is very in depth and you can do a whole crapload of video, text and audio effects with video files from your miniDV or DVD Camcorder. Also included is Nero Photoshow Elite, which really isn't \"Elite,\" but it does a decent job of storing, organizing and editing photos. You can even remove red-eye and other such things. If you havbe the correct specifications and use Firewire, you will realize that Memorex has gone way over-the-top with this wonderful external DVD burner. Definitely worth the money and will prevent your computer from becoming obsolete.The Bottom Line: Don't Use USB and don't use the world's first computer or yes, this probably won't work out for you.",
    "overall": 5.0,
    "summary": "The Best Burner On the Market...and the Software Is Good!",
    "unixReviewTime": 1149465600,
    "reviewTime": "06 5, 2006"
  },
  {
    "reviewerID": "A25FYE1EC81X8Q",
    "asin": "B0007OWASE",
    "reviewerName": "Helmut Standke",
    "helpful": [
      0,
      0
    ],
    "reviewText": "As far as I can tell at this point--I will use the recorder a lot in a few weeks--the Memorex DVD Double-Layer Recorder 16x16 Dual Format External Drive is working flowlessly. Thanks Memorex! Helmut S.",
    "overall": 5.0,
    "summary": "Perfect operation",
    "unixReviewTime": 1179446400,
    "reviewTime": "05 18, 2007"
  },
  {
    "reviewerID": "A1M31MEQ09BS0I",
    "asin": "B0007OWASE",
    "reviewerName": "H. Mounts",
    "helpful": [
      0,
      1
    ],
    "reviewText": "My computer is not fast enough for this recorder but it still does a remarkable job of recording and when I get a new computer I am sure we will have a great relationship. Thanks",
    "overall": 5.0,
    "summary": "Great DVD recoder",
    "unixReviewTime": 1184889600,
    "reviewTime": "07 20, 2007"
  },
  {
    "reviewerID": "A2P4ZH6YBLTNS3",
    "asin": "B0007OWASE",
    "reviewerName": "icomefromearth01",
    "helpful": [
      0,
      0
    ],
    "reviewText": "it's an ok product. didn't have any problems connecting and using it with my near ancient 2005 computer. good workhorse.",
    "overall": 4.0,
    "summary": "memorex review",
    "unixReviewTime": 1373068800,
    "reviewTime": "07 6, 2013"
  },
  {
    "reviewerID": "ASTLZQ0GXS85V",
    "asin": "B0007OWASE",
    "reviewerName": "James A. Stapleton \"Scubasaurus\"",
    "helpful": [
      4,
      6
    ],
    "reviewText": "I just bought this drive - it came bundled with Nero v6.6 which DOES NOT work with Windows Vista.  I contacted Memorex support about this problem and they told me to get the latest update from Nero.  Unfortunately, there are no updates to Nero 6 that make it compatible with Vista - you have to upgrade to Nero 7, which costs more than I paid for the drive.  Memorex ignored my follow-up request for a free solution to the problem they caused.  I will be returning this drive and getting a Sony that comes with Nero 7.  Current products should come with software that works on current operating systems.",
    "overall": 2.0,
    "summary": "keep shopping - bundled software won't work on Vista",
    "unixReviewTime": 1178668800,
    "reviewTime": "05 9, 2007"
  },
  {
    "reviewerID": "A3SWXZJYHLNKQU",
    "asin": "B0007OWASE",
    "reviewerName": "James A. Starkey, Jr. \"mindjime\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Easy to set up and operate. I have made numerous kinds of DVD's from digital videos to making back ups!Back To The Blanket: A Native Narrative Of Discovery",
    "overall": 5.0,
    "summary": "Satisfaction!!!!",
    "unixReviewTime": 1185753600,
    "reviewTime": "07 30, 2007"
  },
  {
    "reviewerID": "A3T3S48UAVTUE9",
    "asin": "B0007OWASE",
    "reviewerName": "JanFla \"Martial Artist\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "We needed a new DVD burner because the internal one died.  Ordered this external unit and it was up and running in minutes.  We were asked to  video and snap pictures for our grandaughters' play and produce DVDs and CDs for the partipants.  This unit handled it like a pro.  The video was 17 MB when downloaded to the pc.  My husband added scanned pages of cast, credits and info about the play and about 20 photos to the file and after rendering (4.5 hours), we were able to burn the DVDs in 6 minutes each. I highly recommend this unit.",
    "overall": 5.0,
    "summary": "Fast burn time",
    "unixReviewTime": 1179273600,
    "reviewTime": "05 16, 2007"
  },
  {
    "reviewerID": "AGZMF9QBZ7ARE",
    "asin": "B0007OWASE",
    "reviewerName": "JAY THE JUDGE",
    "helpful": [
      2,
      3
    ],
    "reviewText": "The device is perfect using other software but the Nero Package kept demanding that I buy an upgrade evertime I clicked on a function!!!-- Memorex would do well to dump these idiots at NERO",
    "overall": 3.0,
    "summary": "Perfect so far but Nero Software annoying",
    "unixReviewTime": 1187827200,
    "reviewTime": "08 23, 2007"
  },
  {
    "reviewerID": "A17OHTPAT48JU8",
    "asin": "B0007OWASE",
    "reviewerName": "J. Cross",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Easy set-up, nice read speed.  Haven't done much recording yet but no troubles so far.  Very good price and fast delivery.",
    "overall": 5.0,
    "summary": "Excellent Deal",
    "unixReviewTime": 1179100800,
    "reviewTime": "05 14, 2007"
  },
  {
    "reviewerID": "A2J240JZS007AX",
    "asin": "B0007OWASE",
    "reviewerName": "J. Harshberger",
    "helpful": [
      3,
      5
    ],
    "reviewText": "I am very disappointed with this item.  I give it only 1 star because I have too!Upon connecting the item and loading the software, my computer worked for one day and then completely crashed.  Before the software was loaded, I had no problems.  Memorex blamed me for loading the software, however everything required by the software met with my computers abilities.  I returned this item and spent way too much money fixing my computer.I am very disappointed with this item and with the customer service from Memorex.  I would not recommend this product or this company to my worst enemy!",
    "overall": 1.0,
    "summary": "Not a good experience",
    "unixReviewTime": 1181865600,
    "reviewTime": "06 15, 2007"
  },
  {
    "reviewerID": "A3I8QN7SBJFJMV",
    "asin": "B0007OWASE",
    "reviewerName": "KC \"KC\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I haven't used the double layer feature yet, but I am quite pleased with the speed and accuracy of this burner. The software it comes with is also excellent (Nero). I burn a lot of photographs to DVD, so it gets a good workout. I recommend it for everyone!",
    "overall": 5.0,
    "summary": "Great DVDR for photographers.. and everyone else!",
    "unixReviewTime": 1173916800,
    "reviewTime": "03 15, 2007"
  },
  {
    "reviewerID": "A2L66KSF4G8YMM",
    "asin": "B0007OWASE",
    "reviewerName": "Kevin Dickson",
    "helpful": [
      3,
      7
    ],
    "reviewText": "I've had the unit ofr around 3 months.  It does write fairly quickly--i think the numbers are alittle exagerated.  My biggest problem it the reading.  when ripping audio and video it doesn't skip but there isn't any/enough ram so when playing audio or video directly from the unit it tends to skip...a lot.  Don't bother expecting to playing anything unless you opened the disk in a clean room.",
    "overall": 3.0,
    "summary": "at least its cheap",
    "unixReviewTime": 1162771200,
    "reviewTime": "11 6, 2006"
  },
  {
    "reviewerID": "A2492XE7PBMELT",
    "asin": "B0007OWASE",
    "reviewerName": "K. G. Schneider \"Librarian, Writer, and Booka...",
    "helpful": [
      47,
      48
    ],
    "reviewText": "On its own, this is a reasonably-priced external DVD burner with a quality name brand. I didn't find the case flimsy, and the stand makes the drive very unobtrusive. The buttons are logically placed, and the blue light was bright enough to see across the room. The drive was visible to my laptop as soon as I attached it. The DVD I made last night burned fairly quickly (and quietly), and bingo, I soon had my very first home-movie-on-DVD, complete with chapter titles and cueing and so forth. I didn't try transferring with USB--a Firewire card was only $25, a cheap way to ensure better image quality--but Memorex thoughtfully includes cables for both.The included software, Nero 6, makes this drive an even better deal. This burn/edit package has a lot of features for an OEM version, more than I'll need for a long time, and should you want to step up to Nero 7, nero.com offers a good discount. The only negative with the software was having to go into the Windows registry to get the serial number to qualify for the version updates--the manual walks you through this, and since I once had a job that required registry edits, this wasn't difficult, but I question how wise it is for Nero to make an average user dig into the Windows registry!You can get much better deals on internal burners, but if you need an external burner, particularly if you don't already have a software package for editing and burning DVDs, it would be hard to find a better deal than this drive.Aside: after staring at my Seagate hard drive and the Memorex burner side by side all last night, I was thinking I'd like to see some enterprising company bundle a large hard drive right on a DVD burner. But with that spare USB cable, it's easy enough to get the two together for a movie-making session..!",
    "overall": 5.0,
    "summary": "Nice hardware, surprisingly good software",
    "unixReviewTime": 1143936000,
    "reviewTime": "04 2, 2006"
  },
  {
    "reviewerID": "A31TGO657MBUCT",
    "asin": "B0007OWASE",
    "reviewerName": "Kindle Customer",
    "helpful": [
      1,
      2
    ],
    "reviewText": "I did not find this product satisfactory because it requiresd the installation of Nero.  I have a copy of Nero already installed, but it is  a later edition than that contained in this product.  To use the new product I would have to uninstall the later version which I would not do so I have not used  this system.  It's too bad it appears I just blew my money.  TS",
    "overall": 2.0,
    "summary": "why I didnot install theis product.",
    "unixReviewTime": 1184889600,
    "reviewTime": "07 20, 2007"
  },
  {
    "reviewerID": "ARIH8ZC1I7XRN",
    "asin": "B0007OWASE",
    "reviewerName": "L. Hargrave \"catwoman\"",
    "helpful": [
      2,
      4
    ],
    "reviewText": "I don't know if the problem was the device or the software but I never could get it to work. I installed and uninstalled it several times to no avail so I took it to Staples and got one of their techs to try it and he got it to work. When I got home, it wouldn't work. So I gave up and sent it back.",
    "overall": 1.0,
    "summary": "a waste of money",
    "unixReviewTime": 1188432000,
    "reviewTime": "08 30, 2007"
  },
  {
    "reviewerID": "A2CXYV01TSAXMQ",
    "asin": "B0007OWASE",
    "reviewerName": "Lloyd Roseman",
    "helpful": [
      3,
      7
    ],
    "reviewText": "Ok, when I bought this product online I thought I was buying a machine that would burn my digital videos from my camcorder unto a disk that I could play back on my dvd player. So far it hasn't done that. It will copy unto the disk and it will playback on my PC, but not on my dvd player. When I received the nero 6 software I didn't know I had to upgrade to the nero 7 in order to edit and copy my movies to a dvd.I guess I misunderstood what this recorder was for. It's not exactly what I wanted. Thank you.",
    "overall": 1.0,
    "summary": "misunderstood",
    "unixReviewTime": 1184630400,
    "reviewTime": "07 17, 2007"
  },
  {
    "reviewerID": "A19P3U89SH9RNA",
    "asin": "B0007OWASE",
    "reviewerName": "Misled Customer",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Don't believe the advertising that is printed on the box!!  I just setup my new Memorex DVD recorder with the intent of being able to use the included software to print Lightscribe labels...as advertisied. However the \"Essential\" version of Nero that is included, acutally means basic or trial version and doesn't support Lightscribe.  Even though Memorex was kind enough to put a \"Bonus\" Lightscribe CD-R in the package...almost to rub in your face that you were tricked into believing what the manufacture claims on the box.  What a rip off.  I will not purchase any more items from Memorex.",
    "overall": 1.0,
    "summary": "Misleading Advertising",
    "unixReviewTime": 1216166400,
    "reviewTime": "07 16, 2008"
  },
  {
    "reviewerID": "AAZDEAF5E4ACR",
    "asin": "B0007OWASE",
    "reviewerName": "Mr. Nobody \"Kamen\"",
    "helpful": [
      11,
      12
    ],
    "reviewText": "I have been using this for about two days now.  I guess it is my stupidity, but I found Nero unnecessarily complex.  I was not able to record a data disk (double layer) after numerous attempts.  The language and the terminology is too Nero-esque.  In the end I removed Nero from my computer and am using the Sonic software, which is far superior, faster, simpler, and user-friendlier.  My advice is to buy Memorex but never bother with the installation of Nero.  Good luck.",
    "overall": 4.0,
    "summary": "Great product, lousy software",
    "unixReviewTime": 1156636800,
    "reviewTime": "08 27, 2006"
  },
  {
    "reviewerID": "A2C8FQXBOTLMT6",
    "asin": "B0007OWASE",
    "reviewerName": "Ms. Dee",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I purchased this burner a little over a year ago and at first it worked fine.  I was always very careful with it.  Kept it in a safe spot on my desk and only got to copy about 50 discs before it went berserk on me.  Three months ago it stopped functioning correctly.  The driver just spins uncontrollably whenever I try to copy a disc or reproduce it.  It just goes on and on and doesn't stop unless I manually interrupt it.  Error messages popping up all over the place.  I thought it was a glitch with my computer, so I reinstalled the software into another computer.  The same problem occurred.  It won't read the discs properly, nor will it burn them.  I have given up, and since the warranty has expired, there's nothing I can do.  Bad investment considering I only produced 50 dvds/cds.  Next time, I'll try another brand and cheaper, too.",
    "overall": 2.0,
    "summary": "Not very durable",
    "unixReviewTime": 1267228800,
    "reviewTime": "02 27, 2010"
  },
  {
    "reviewerID": "A7U7PUL8BUPSB",
    "asin": "B0007OWASE",
    "reviewerName": "New York's Bravest",
    "helpful": [
      2,
      2
    ],
    "reviewText": "Couldn't be happier...Currently hooked to USB2.0 port.. burns full DVD-r 8x in appx 8 minutes..Can't wait to try in on a Firewire port with a 16x DVD :)",
    "overall": 5.0,
    "summary": "Buy it, you'll like it",
    "unixReviewTime": 1172880000,
    "reviewTime": "03 3, 2007"
  },
  {
    "reviewerID": "ADJMHTQGB6L2H",
    "asin": "B0007OWASE",
    "reviewerName": "Nick",
    "helpful": [
      2,
      2
    ],
    "reviewText": "My powerbook is falling apart piece by piece but I wanted to wait a year to replace it.Q: How do I burn DVDs with a kaput burner?A: Buy the cheapest DVD burner on Amazon.The Memorex 32023288 works great. Plugged in and went to work.The drawback is that with the USB connection it only burns 1x, making it difficult if you're burning something on an external drive.Be warned, I fried my Lacie external drive by daisy-chaining it through the Memorex's firewire port. In retrospect it seems like a stupid thing to have done, even though there was no warning with the Memorex not to use it in a firewire daisy-chain with a hard drive. I'm going to contact Memorex about this situation.Despite the annoyance of that anecdote and the fact that that the Memorex 32023288 can't love me back I'm positive about this product, especially for the price.",
    "overall": 4.0,
    "summary": "Gets The Job Done",
    "unixReviewTime": 1186790400,
    "reviewTime": "08 11, 2007"
  },
  {
    "reviewerID": "A34FPGTW703E17",
    "asin": "B0007OWASE",
    "reviewerName": "Nirav M. Patel \"Parth Bhavsar\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Used it to burn few DVDS and its working fine. Less noisey then expected...good one.",
    "overall": 4.0,
    "summary": "good one",
    "unixReviewTime": 1170720000,
    "reviewTime": "02 6, 2007"
  },
  {
    "reviewerID": "ASQE6CIJXX6HH",
    "asin": "B0007OWASE",
    "reviewerName": "NomDePlume",
    "helpful": [
      3,
      4
    ],
    "reviewText": "For reasons unknown, my aging PC ceased to get along with its internal DVD-ROM drive.  I tried replacing the drive, but that didn't work, so I gave up on watching DVD's - until I spied this guy.  I plugged it in, XP recognized the drive, and in thirty seconds I was watching a DVD for the first time in months (haven't installed the software, don't plan to).  All l want is a DVD player, and it plays great; if I ever want to burn a DVD, I'm all set.Playback is excellent with either connection - Firewire or USB.  I use Firewire to keep my USB ports free; even with high-end audio, DVD playback is as good, or better, than the internal drive was when it was new.UPDATE, Nov. '09:  It burns just fine, too.  I've burned dozens of DVDs now, no problems.  A couple little quirks:  Every time I want to burn, I have to go to /Properties/Recording and enable \"cd recording\" -- no biggie.  Also, one of the burning programs I use the most won't burn if the drive is connected via Firewire, but works fine with USB. Again, no biggie.My rating stands -- five stars, and money well spent!",
    "overall": 5.0,
    "summary": "...and it's a great player, too!",
    "unixReviewTime": 1180224000,
    "reviewTime": "05 27, 2007"
  },
  {
    "reviewerID": "A216J18RQWRS4A",
    "asin": "B0007OWASE",
    "reviewerName": "Pauline \"ThatScaryChick\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I have had my DVD recorder for about a week now and I really love it. I haven't had any problems with it and unlike others who have given reviews, it isn't loud at all. In fact, it's quite the opposite. As of now, I have burned over 24 disks with it and all but one has been great. (I believe I had a problem with the movie I was burning.) I would recommend this product to anyone looking for an external dvd burner for their computer. It is lower priced and very good quality!The only thing I do have a complaint about is that it didn't come in it's original packaging from the seller who I bought it from. It was sent wrapped in newspaper and bubble-wrap (along with the cords, plugs, etc.) and put in the fedex box. I would have like it to have had been sent in it original box. This is more to do with the seller then the product itself, which works great.",
    "overall": 5.0,
    "summary": "Very nice recorder!",
    "unixReviewTime": 1182643200,
    "reviewTime": "06 24, 2007"
  },
  {
    "reviewerID": "A11ET237Q49CW2",
    "asin": "B0007OWASE",
    "reviewerName": "Paul K. Beatty",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Fast and reliable drive. Easy to set up and get going. My only complaint is that it's a little noisier than other drives I've used.",
    "overall": 4.0,
    "summary": "Good Drive, Good Price",
    "unixReviewTime": 1189987200,
    "reviewTime": "09 17, 2007"
  },
  {
    "reviewerID": "A169FZ57X9UUZ8",
    "asin": "B0007OWASE",
    "reviewerName": "Poisy",
    "helpful": [
      5,
      5
    ],
    "reviewText": "Ok, the recorder arrived super fast and it's been WORKING perfectly ever since. I've read a lot of reviews, and here's some hints that might help those who never got it work:If you have Windows XP and Vista, sinmply connect the recorder via your USB/WiFi port, your PC will install it automatically, no other actions needed.If you like the recording software already installed on your PC - don't bother even open any CDs coming with the recorder - it works perfectly with ANY software (I checked it myself).If someone's bothered that after installation the recorder appears like CD-ROM - don't. It still works as it's supposed to.Basically that's it. I can't think of other problems:)",
    "overall": 5.0,
    "summary": "Excellent choice",
    "unixReviewTime": 1188518400,
    "reviewTime": "08 31, 2007"
  },
  {
    "reviewerID": "A2JY8U7S2D5DSM",
    "asin": "B0007OWASE",
    "reviewerName": "RBO \"RBO\"",
    "helpful": [
      2,
      2
    ],
    "reviewText": "We tried for several days to get the nero software to operate with our dell laptop. We updated, filled out forms, read the reviews to get hints - nothing worked. It would play the sound ok, but the picture was a bunch of colored lines - ie, no picture. It was a hassle and I finally returned it. The problem was the included nero software, not the hardware - go figure.",
    "overall": 1.0,
    "summary": "Memorex 32023288 DVD Double-Layer Recorder 16x16",
    "unixReviewTime": 1180656000,
    "reviewTime": "06 1, 2007"
  },
  {
    "reviewerID": "A91PW87FR65XH",
    "asin": "B0007OWASE",
    "reviewerName": "R. J. Province \"Blade\"",
    "helpful": [
      0,
      7
    ],
    "reviewText": "I got this from TheFactoryDepot and what a rip off. First theyover charged me, then they take 2 weeks to get it to me, theneverything I burn will not play in any of my DVD players. Ieven got the Memorex DVDs from TheFactoryDepot and they arrivedwith scratches. I don't know what's wrong. It seems likeeverything I get from TheFactoryDepot is either defective ora piece of junk.",
    "overall": 1.0,
    "summary": "This Is A Piece Of Junk",
    "unixReviewTime": 1178841600,
    "reviewTime": "05 11, 2007"
  },
  {
    "reviewerID": "A5X444UZBWXW2",
    "asin": "B0007OWASE",
    "reviewerName": "Robert Marshall \"Sheriff of Tucson\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Works just fine - but - comes up to speed when reading like a prop plane revving up. Not a problem, just kind of surprising at first.Also - if you are adding this to a box that already has a dvd drive, you may have to turn this off to boot up normally. Easy swiching though.Keeper!Bought one for each of my main computers. An HP drive, when added-on with an existing dvd drive, almost destroyed my system and the outsourced support was abominable.",
    "overall": 4.0,
    "summary": "Be aware",
    "unixReviewTime": 1180051200,
    "reviewTime": "05 25, 2007"
  },
  {
    "reviewerID": "A6FIAB28IS79",
    "asin": "B0007OWASE",
    "reviewerName": "Samuel Chell",
    "helpful": [
      9,
      10
    ],
    "reviewText": "The \"Superdrive\" on my two-year-old desk-top iMac with 17\" flat-panel simply died on me a month ago, in effect putting my audio-video life on hold.  No time to pack and ship out the cumbersome machine for repair, so for less than the price of one of those little Apple power adapters with the folding prongs, I ordered this Memorex drive.  It's a bit larger and heavier than I'd anticipated, but it's certainly sturdy and well-equipped: a two-part long-reaching power supply and cord, a USB as well as a Firewire cable depending on your preference (Apple doesn't even include one with a new computer), and a stand for vertical, space-saving use of the drive.  I simply plugged it in, connected the Firewire cable, inserted a DVD, and that was all there was to it.  For the first time in weeks, I saw a disc on my computer's desk top.Next test: I inserted a blank CD into the Memorex, selected 70 minutes worth of tunes from my iTunes library, clicked on \"burn CD.\"  This produced the following question: \"Your preferred recording drive is not available.  Would you like to use the external Memorex drive?\"  I clicked \"yes,\" waited no more than 3-4 minutes, and a spanking new CD was born.  I had planned to use the Memorex as a temporary device, until time and energy would allow me to have the iMac Superdrive repaired.  Obviously, a bad idea.  Stick with the Memorex for another year, by which time the iMac will be out of date and worthless.A lot of software comes with the drive, but with iTunes, Roxio Toast, Sound Studio, and other clutter already installed on my machine, I doubt it'll see any use.  Still, if it's as efficient and user-friendly as the drive, it could be a huge bonus for some owners.[I'm surprised about the negatives concerning the above.  This relatively inexpensive device was frankly a life-saver.  I still haven't read the manual or installed a thing, and it continues to burn files in my iTunes folder and function with my iMac like it was made for that purpose. I haven't tried burning a DVD or an MP3 disc, so I can't make any claims about those functions as yet.]",
    "overall": 5.0,
    "summary": "David rescues Goliath",
    "unixReviewTime": 1183680000,
    "reviewTime": "07 6, 2007"
  },
  {
    "reviewerID": "A1MHCEU6QSEOSM",
    "asin": "B0007OWASE",
    "reviewerName": "Sean Green",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I was very pleased with this product,it lived up to almost all my expectations.Super easy to operate.",
    "overall": 4.0,
    "summary": "very pleased",
    "unixReviewTime": 1179705600,
    "reviewTime": "05 21, 2007"
  },
  {
    "reviewerID": "A3VLNKFO28T5ZD",
    "asin": "B0007OWASE",
    "reviewerName": "Shane Davies \"MacOSXGuy\"",
    "helpful": [
      19,
      20
    ],
    "reviewText": "I am very pleased with the performance of this machine. I bought it to add dual layer dvd's and 16x burning to my aging Powermac G5 from Apple. It has worked perfectly for me and makes DVD's in about 3 minutes. A very nice touch. As a side note, I am a world traveler and I am planning on moving to London at the start of next year. I was afraid that it would not be able to go with me. But I contacted Memorex and it already is wired to work in the U.S. and Europe. That was a nice surprise. Buy this product, you will not be disappointed.",
    "overall": 5.0,
    "summary": "Excellent Addition to my computer products.",
    "unixReviewTime": 1156550400,
    "reviewTime": "08 26, 2006"
  },
  {
    "reviewerID": "A17149IO1JDX36",
    "asin": "B0007OWASE",
    "reviewerName": "S. Hurd",
    "helpful": [
      3,
      3
    ],
    "reviewText": "I got this dvd burner 2 days ago.  I have already burned 10 dvds with this.  It is a good-looking burner.  It can lay flat, or it has a stand for vertical placement.  It was easy to connect to the computer and install the provided software.It comes with Nero.  This seems to be a really good program.  Unfortunately, some of the features, like creating dvd movies, are only 30 day trials, and not included with the program.  To get the dvd movie feature, it costs $25.  I was unhappy when I realized that I didn't get the entire Nero program, especially since I wanted this dvd burner so I could create movies that would play on my dvd player hooked to my tv.  But, the program is very easy to use and has thus far been reliable.It takes about an hour to transcode the data into the correct format, then the actual time it takes to burn the disc is very quick.",
    "overall": 4.0,
    "summary": "Good for the money",
    "unixReviewTime": 1175212800,
    "reviewTime": "03 30, 2007"
  },
  {
    "reviewerID": "AJJD4ABAHIK2R",
    "asin": "B0007OWASE",
    "reviewerName": "Stacie",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I just got this burner today, and I just wanted to write a review about how pleasantly surprised I was with it. Reading some of the reviews I was beginning to regreat buying it, but I figured I would give it a shot. I bought this burner because I wanted a DVD burner along with a CD burner and my internal burner which only burns CDs is no longer working. The burn speed is a little bit slower than my internal burner (this one took about 8 minutes to burn a CD, whereas my internal burner would only take about 3-4 minutes) but the time it takes to burn is reasonable. I haven't tried to burn a DVD yet, so we'll see what happens. I only gave it 4 stars because I'm not sure of how it burns DVDs yet.",
    "overall": 4.0,
    "summary": "pleasantly surprised",
    "unixReviewTime": 1170374400,
    "reviewTime": "02 2, 2007"
  },
  {
    "reviewerID": "AONG0Z2OA896X",
    "asin": "B0007OWASE",
    "reviewerName": "S. Taylor",
    "helpful": [
      90,
      91
    ],
    "reviewText": "I have only had this drive for a couple days, but I can say that I am pleased with it overall.  I am using it with a laptop on a comapct desk, so the fact that it stands vertically (w/included stand) helps with space consevation.  The Dual-Layer DVDs that it can create are wonderfull for storing lots of home videos, pictures, and in most cases 2 full movies.  The included Nero software is very user friendly, so you'll be making relatively professional looking DVD home movies (complete with custom menus and options) in no time.I only have 2 things to complain about on this package (one on the unit and one on the software), and they are just nit-picky little things.1.  UNIT -  While the unit itself is fairly attractive (silver & black case  w/blue LEDs), it is rather flimsy.  This is not really an issue as long as you are careful moving it while it is running.  Without thinking, I grabbed the body by the sides while in its vertical position.  This caused the top of the case to bow in and hit the drive spindle, resulting in an awful grinding noise.  While this incident had no affect on the unit or its current process this time, I could see how it may in future careless occurances. Not a big deal.  Just don't be clumsy like me.2.  SOFTWARE -  Again, not a big problem, just an annoyance.  I am running this program on what the box calls the preferred sytem specs for best performance.  While creating a 2 hour (4.07 GB) DVD movie with basic menus only takes a few minutes, the processing time before it writes takes a long time.  After you hit the \"Burn\" button, the total process progress line says that the time remaining on the project is a little over 4 hours.  The actual time it takes to write on the disc is a little more than an hour (this is a pretty fast drive).  The other 3 hours seems to be taken up by conversion, encoding, processing, etc.  My guess is that this would take a lot less time on a faster system.  Read the \"System Requirements\" for the software on the box.  I suggest having at least the \"Reccomended\" specs to have a pleasent experience.  If you only have the minimum system requirements, I would be prepared to settle in for the long haul for each project.Also, I bought this in store at Staples for a hundred and thirty-nine bucks.  Much cheaper than anywhere else I saw it.",
    "overall": 4.0,
    "summary": "Nice compact drive w/easy to use software.",
    "unixReviewTime": 1120694400,
    "reviewTime": "07 7, 2005"
  },
  {
    "reviewerID": "A1Y41N5FHA2LH7",
    "asin": "B0007OWASE",
    "reviewerName": "Taunya N. Hinojosa",
    "helpful": [
      0,
      4
    ],
    "reviewText": "I would really have liked to have known, before purchasing the item, that it was not compatible with Apple computers.",
    "overall": 1.0,
    "summary": "Does not work with Apple!",
    "unixReviewTime": 1189296000,
    "reviewTime": "09 9, 2007"
  },
  {
    "reviewerID": "A1T4JVMH0L1BO",
    "asin": "B0007OWASE",
    "reviewerName": "Tim Boudin",
    "helpful": [
      5,
      12
    ],
    "reviewText": "This product works very well and the software for it is very good too.",
    "overall": 5.0,
    "summary": "External CD Writer",
    "unixReviewTime": 1154044800,
    "reviewTime": "07 28, 2006"
  },
  {
    "reviewerID": "A2E42NZXLEWV6G",
    "asin": "B0007OWASE",
    "reviewerName": "Valerie K \"Vivi-Chan\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I just got my Memorex DVD Burner and burnt my first DVD which took about 50-55 minutes. Not bad compared to what I have heard for some people.1)The burner is sleek, stable, and nicely built.2)It gives you step by step instructions on how to set it up, which is especially helpful if you are not computer savvy.3)If you open the NeroSmart Start, it's a user-friendly interface that helps you fine exactly what you want to do.HOWEVER there are a few things I dislike about the DVD burner, nothing major however.1)The tray seemed a tad wobbly.2)The software is a trial, it is really nice software but it's only a trail version and It costs $60 to get the full program, kind of upsetting...So far I think this is a great investment and I am very happy with it. As an added bonus, I got free shipping from Amazon, and it arrived on the first day during the 'Estimated Time of Arrival'.",
    "overall": 4.0,
    "summary": "Love the Burner but...",
    "unixReviewTime": 1182124800,
    "reviewTime": "06 18, 2007"
  },
  {
    "reviewerID": "AZRZHCQ8VIHJM",
    "asin": "B0007OWASE",
    "reviewerName": "Victor",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Recorder setup instruction is not clear. To install Nero suite software the DVD recorder must be connected and powered on. Nero application won't recognize the recorder if it is not connected during the software installation.Except for this minor problem the performance of the recorder is excellent.I had to get a program to convert format of existing audio file in the hard disc because Nero suite does not have this function. It has this function only recording the files from CD to hard disc.",
    "overall": 4.0,
    "summary": "memorex 32023288 DVD recorder",
    "unixReviewTime": 1180310400,
    "reviewTime": "05 28, 2007"
  },
  {
    "reviewerID": "A2QNKI576EBWD",
    "asin": "B0007OWASE",
    "reviewerName": "Walter E. Hazen \"CleanKing\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "The DVD Recorder works well and does what it is supposed to do.  It has a quirk in that if you don't have the machine on before booting up, it will only appear as a CD recorder.",
    "overall": 5.0,
    "summary": "Memorex review",
    "unixReviewTime": 1181174400,
    "reviewTime": "06 7, 2007"
  },
  {
    "reviewerID": "A3V86NYBVOYYI8",
    "asin": "B0007OWASE",
    "reviewerName": "William Adams",
    "helpful": [
      2,
      3
    ],
    "reviewText": "The hardware _seems_ okay: plays DVDs extremely well with my old version of PowerDVD, and burns CDs with pretty good speed (I've got a firewire connection.) But so far, I've been unable to burn a DVD in any of the packaged Nero applications, not as backup, not as a data disc. (Even the DVD player doesn't work, just keeps popping up a reminder to buy the plug-in.) When burn is attempted with a DVD, disc gives target error, program can't make End of File, or disc isn't recognized at all. I will reluctantly invest in different media (maybe it didn't like these DVD+R discs, though it's supposed to handle DVD+R) and if that's no help, uninstall the Nero and try other burners. If hardware pans out and Nero is the only problem, will come back and raise to three stars (or better, if really fast).",
    "overall": 2.0,
    "summary": "Hasn't burned a DVD yet -- software problem?",
    "unixReviewTime": 1170720000,
    "reviewTime": "02 6, 2007"
  },
  {
    "reviewerID": "A1LP5TT2AHVH9Z",
    "asin": "B0007OWASE",
    "reviewerName": "William Colon \"Godmules\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I used this device for many things, had it for a week an half and it has made my life easier burning dvd, cds, and other good things.",
    "overall": 5.0,
    "summary": "Perfect toy for making great DVDs and other great things",
    "unixReviewTime": 1246406400,
    "reviewTime": "07 1, 2009"
  },
  {
    "reviewerID": "A3B31JB81B13ZI",
    "asin": "B0007OWASE",
    "reviewerName": "William Roussie \"car lover\"",
    "helpful": [
      1,
      10
    ],
    "reviewText": "Honestly, i would like some more time to evaluate the product.  I had some difficulties with the software and have now accessed the correct software for the Recorder.  I will be soon making use of both and should be able to do a bettter evaluation at the end of this month.",
    "overall": 3.0,
    "summary": "Memorex DVD RECORDER review",
    "unixReviewTime": 1168300800,
    "reviewTime": "01 9, 2007"
  },
  {
    "reviewerID": "A23W6ZZMF367PI",
    "asin": "B0007OWASE",
    "reviewerName": "William S. Grigsby \"Ycat\"",
    "helpful": [
      8,
      8
    ],
    "reviewText": "I might have deducted a star for the software included in the package (will not work with Vista and requires a PAID upgrade to a new version), but frankly I'd been made aware of that problem BEFORE making the purchase.The burner has thus far worked flawlessly with every disc I've thrown at it, including many that wouldn't work in any other burner I have.  The drivers installed upon plugin and since then it's worked like a champ.  Sweet.I haven't experienced any significant noise from the unit or any other flaws.So for the burner its 5 stars - maybe the software will work with my old Windows ME box when I get around to trying it out... :)",
    "overall": 5.0,
    "summary": "An excellent buy, all things considered....",
    "unixReviewTime": 1186099200,
    "reviewTime": "08 3, 2007"
  },
  {
    "reviewerID": "A2W4B9IOKDJQ83",
    "asin": "B0007OWASE",
    "reviewerName": "YAA B. AMPADU-SACKEY \"awobiamah\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Great product. Love it to death! Great job Amazon! Again it arrived on time and your Cust. Serv. Reps do a good job too!",
    "overall": 5.0,
    "summary": "Product review",
    "unixReviewTime": 1181174400,
    "reviewTime": "06 7, 2007"
  }
]