[
  {
    "reviewerID": "AKU18EGFF6G02",
    "asin": "B000EI0EB8",
    "reviewerName": "Amazon Customer",
    "helpful": [
      17,
      18
    ],
    "reviewText": "If you search for center channel reviews chances are that you will come up with Bose, Polk, Sony before you find any mention of Cerwin Verga and yet this is what I consider the hidden gem of the home theater. From craftsmanship to it's sound reproduction this speaker is second to none in my opinion. I have owned Bose, Polk and Sony and none of them come close to this Vega in accurate sound reproduction when it comes to movie dialogue. It is inexpensive when ordered directly from amazon. The size is right too making it possible to fit in tight spaces without sacrificing sound quality.",
    "overall": 5.0,
    "summary": "Hidden Gem Of The Home Theater",
    "unixReviewTime": 1263859200,
    "reviewTime": "01 19, 2010"
  },
  {
    "reviewerID": "A3SNQ2R7WVE7I3",
    "asin": "B000EI0EB8",
    "reviewerName": "A. S. Arvind",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I got this speaker as my Centre and I have to say I was very impressed - am still impressed. Except that I have moved these as Left and Right speakers and got an even bigger Centre. The sound quality is very impressive and as L/R speakers, the output is really nice.",
    "overall": 5.0,
    "summary": "Fantastic Speaker",
    "unixReviewTime": 1355097600,
    "reviewTime": "12 10, 2012"
  },
  {
    "reviewerID": "AR6SPWXB6OE78",
    "asin": "B000EI0EB8",
    "reviewerName": "Bash",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Receiver-Pioneer VSX 1020Sub-bic America v1220 435 watts peakCV-center channelCV-frontsJVC-rearsNo lie this system rocks all movies and music presented to it. I Had old Yamaha fronts for 15 years and wanted new sound and I really found it with CV and Bic America.",
    "overall": 4.0,
    "summary": "Great buy and wonderful sound",
    "unixReviewTime": 1379376000,
    "reviewTime": "09 17, 2013"
  },
  {
    "reviewerID": "A2RRGU5II83K2N",
    "asin": "B000EI0EB8",
    "reviewerName": "bigdaddyx57",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Love Cerwin Vega, sound great in my basement hooked up to surround sound its a good center speaker for 7.1",
    "overall": 5.0,
    "summary": "Good Center for Cerwin Vega",
    "unixReviewTime": 1304380800,
    "reviewTime": "05 3, 2011"
  },
  {
    "reviewerID": "A2IDZP6NK9MBOS",
    "asin": "B000EI0EB8",
    "reviewerName": "C. A. Bergman",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This replaces a Bose center speaker, this is as good or maybe better.  I like the wattage capability.  Nice cabinet and hook up.  I'm not afraid to &#34;turn up the volume&#34;.  I am very pleased with this purchase!!",
    "overall": 4.0,
    "summary": "Good sound!!!",
    "unixReviewTime": 1398470400,
    "reviewTime": "04 26, 2014"
  },
  {
    "reviewerID": "A28JBCFJ3B34V4",
    "asin": "B000EI0EB8",
    "reviewerName": "C. Alindog",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Had these for a month now and these speakers made a HUGE difference when added to my front speakers. And for the price for under $80 this things just can't be beat. Surprisingly this thing also pumps up some bass (set it to large) and that just made it even better. WORTH EVERY PENNY!! Did i mention it looks attractive too (subjective) lol",
    "overall": 5.0,
    "summary": "WOW!! What a difference!",
    "unixReviewTime": 1394064000,
    "reviewTime": "03 6, 2014"
  },
  {
    "reviewerID": "A14C61ZJF644BA",
    "asin": "B000EI0EB8",
    "reviewerName": "CG",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The sound coming out of this speaker is crisp, clean and clear. I even lowered the master volume on my Pioneer AV system since the sound coming out of this speaker is so much better than my speaker in a box. I highly recommend this speaker for anyone not wanting to break the bank.",
    "overall": 5.0,
    "summary": "Great entry level speaker",
    "unixReviewTime": 1350604800,
    "reviewTime": "10 19, 2012"
  },
  {
    "reviewerID": "A3VTKIXXB1UV3D",
    "asin": "B000EI0EB8",
    "reviewerName": "Chip",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This center speaker complete my three way stereo system. This speaker is very loud and clear with just the right amount of bass. They are also well built so I am not scare to turn it up. I would buy them again and recommend them to a friend",
    "overall": 5.0,
    "summary": "Clear Crisp Sounds",
    "unixReviewTime": 1395619200,
    "reviewTime": "03 24, 2014"
  },
  {
    "reviewerID": "A13S25YAUVTB98",
    "asin": "B000EI0EB8",
    "reviewerName": "CinemaPete",
    "helpful": [
      0,
      0
    ],
    "reviewText": "The VE-5C is a very solidly made and compact center-channel speaker.  However, it produced a rather prominent &#34;horn-like&#34; sound on most material - at least in my system which uses the center-channel from an OPPO BDP-95 Universal player that provide discrete analog output of all 7.1 channels.  I feed the center-channel output (from the OPPO) to its own dedicated amp (which also can control level) with amp output to the Cerwin-Vega VE-5C.  Keep in mind that the center-channel audio on many disks is hyped-up anyhow and will sound very prominent so my comment is not necessarily that the Cerwin-Vega is a &#34;bad sounding&#34; center-channel speaker.  With an arrangement as mine, or similar where there are discrete line-level outputs for the various channels, It is possible to insert a modest 5-band equalizer in the signal path (between the output of the OPPO center-channel and the input to the power amp) and use the equalizer to provide some &#34;sound tailoring&#34; to tone down a bit of the horn-like prominence - of course, this would only work where the discrete analog outputs are line-level and not speaker level.  For systems that allow you to tailor the sound spectrum of the various channels within their setup procedures (i.e. software controlled) then an equalizer would not be required.",
    "overall": 3.0,
    "summary": "Decent Center-Channel Speaker",
    "unixReviewTime": 1401148800,
    "reviewTime": "05 27, 2014"
  },
  {
    "reviewerID": "A3U5ZQC2D3Z1H0",
    "asin": "B000EI0EB8",
    "reviewerName": "Cletus Jewels",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I am using two ve-12's as my fronts and wanted a center to be voice matched. The mids and highs arent as clear as my JBL Northridgebut this is a decent center with good bass. I will keep this center speaker.",
    "overall": 4.0,
    "summary": "Can be cranked to infinti and beyond!",
    "unixReviewTime": 1306713600,
    "reviewTime": "05 30, 2011"
  },
  {
    "reviewerID": "A358034EI4T6XV",
    "asin": "B000EI0EB8",
    "reviewerName": "Dale Robinson",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Great sound, good definition of perfect center speaker. I was looking for a quick replacement for center speaker that got broken during a move . PERFECT",
    "overall": 4.0,
    "summary": "Very nice",
    "unixReviewTime": 1394496000,
    "reviewTime": "03 11, 2014"
  },
  {
    "reviewerID": "A2MHAVUDATABRP",
    "asin": "B000EI0EB8",
    "reviewerName": "Danny",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I cant say nothing bad at all about the Cerwin Vega speakers, I Got this because I got the 6.5 rear Cerwin Vega surround sound speakers. I have a pair or 12s Cerwin Vega and 8inch Cerwin Vega speakers. I also have a set of psb bronze. and the Cerwin-Vegas! sound 100% better than the psb. This center speaker sounds great. Do yourself a favor get yourself one. and get a pair of them 6.5 Cerwin vega too. I bought mine from amazon. The highs are clear as a bell and great mids and believe it of not it puts out a good amount of bass for the size. But it is a Cerwin Vega! Nothing but great things about Cerwin Vega! And they are made in the U.S.A Do everyone a favor Buy U.S.A",
    "overall": 5.0,
    "summary": "Great center channel speaker",
    "unixReviewTime": 1396051200,
    "reviewTime": "03 29, 2014"
  },
  {
    "reviewerID": "A3KZUBM6S477EQ",
    "asin": "B000EI0EB8",
    "reviewerName": "Darius Jackson \"Action Jackson\"",
    "helpful": [
      35,
      38
    ],
    "reviewText": "You have the big front/lefts, you have the big 15\" subwoofer that rattles the street, you have the 25 different surrounds all mounted on your wall, you have the 1000watt+ HT receiver tuned just perfectly. You think you got it all figured out... until you skimp on the center channel. Now your left scratching your head wondering why the voices are low, action scenes are insanely blaring, and theres just an overall unevenness in all your movies.If you find yourself turning up the movie/show during dialog and then turning it down during action, It's time to get a real center, dump the satellite speakers that pretends it can accurately reproduce movie soundtrack and voice dialog, most of them fail.Insert 70 dollar Cerwin Vega ve-5c. This speaker brought out the sounds in movies I knew were getting drowned out by the incompetence of a satellite speaker. Although the center doesn't handle bass, for giggles I set it to large and watched some intense action scenes from star trek/transformers/saving private ryan, and the amount of clean, snappy bass that this 1 speaker produced was quite impressive. It has great excursion and can seriously move some air when cranked up.Oh yeah, thats another thing - this baby is loud, but thats a Cerwin Vega trademark. While some audiophiles always ding Cerwin Vega for being \"too loud/bassy\" I find this to be perfect because it allows more flexibility in tuning. This speaker eats up anything you throw at it at beyond deafening sound levels, and it does it with authority. I would really recommend this center for the price... 70 dollars is nothing, and you get outstanding value.",
    "overall": 5.0,
    "summary": "The most underrated speaker in the HT setup",
    "unixReviewTime": 1266451200,
    "reviewTime": "02 18, 2010"
  },
  {
    "reviewerID": "A1NR5OXWIXQ40D",
    "asin": "B000EI0EB8",
    "reviewerName": "Dave Charlebois",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I'm a long time Cerwin owner and am finally up grading to a 5.1 surround system. What I'm most impressed with is the value these speakers offer. The vocals are loud and clear, and seem to keep pace with my D-9 mains. I feel that for the money a better center couldn't be found. What really surprised me is the mid-range punch it can add to movies and games, if EQ'd to do so. The 5 inch drivers will pump, if you like it loud! All in all, a great little speaker!",
    "overall": 5.0,
    "summary": "CerwinVega VE-5C Center Channel Speaker",
    "unixReviewTime": 1395446400,
    "reviewTime": "03 22, 2014"
  },
  {
    "reviewerID": "A2ESTTJ1K3VW4V",
    "asin": "B000EI0EB8",
    "reviewerName": "David Stephens",
    "helpful": [
      2,
      3
    ],
    "reviewText": "I replaced my Pioneer center channel with the Cerwin Vega and couldnt be happier. The sound is smooth as butter, the audio tracks on movies are clear and up front...the way it should be. You can crank this thing to the moon and back and it wont phase it. FOR THE MONEY, its a probably the best center channel on the market. i will definetly consider other Cerwin Vega Products. My system:Pioneer VSX D411 RecieverCerwin Vega VE 5C center channelpioneer speakers front- SH253BKPolk Audio rear speakers- R-150Sony 8\" sub- SAWM20 100watt- not enough bass for me though(will be replaced soon with a Cerwin Vega sub)Maganavox NB500MG9 Blu-RaySiemens 500 gig dvrMonster HDP1800 power managementPanasonic 42\" plasmaXbox 360",
    "overall": 5.0,
    "summary": "Cerwin Vega! ROCKS!!!!",
    "unixReviewTime": 1232496000,
    "reviewTime": "01 21, 2009"
  },
  {
    "reviewerID": "A291SEANVC5M81",
    "asin": "B000EI0EB8",
    "reviewerName": "DB",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This really made a difference in hearing vocals on movies.  It makes the stereo separation more noticable too.  It's difficult to get the scale from looking at the picture.  I was worried this would be bulky and in the way, but it's actually quite small while still packing a punch.  It goes great with the rest of my Vega's, even though my Vega's are an older design.  The only complaint I have is that I couldn't take the cover off to show the red.  It feels like it's permanent, I'm afraid to pull any harder and break it.  I like popping off the covers of my older vegas during party's to show off the sexy red speakers...",
    "overall": 5.0,
    "summary": "Why did I wait so long to get a Center Channel Speaker?!?",
    "unixReviewTime": 1355443200,
    "reviewTime": "12 14, 2012"
  },
  {
    "reviewerID": "A1IDPYOS8B5FJ4",
    "asin": "B000EI0EB8",
    "reviewerName": "dewdaddy",
    "helpful": [
      5,
      6
    ],
    "reviewText": "It has good sound and quality for it's size. It handles high volume well and looks good. i think for the money it is a good value for the quality that you get.",
    "overall": 4.0,
    "summary": "good sound, good quality",
    "unixReviewTime": 1296172800,
    "reviewTime": "01 28, 2011"
  },
  {
    "reviewerID": "A2NZ1V29Q6DL4C",
    "asin": "B000EI0EB8",
    "reviewerName": "D",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I have four JBL satellite 2 speakers and a JBL reciever/amplifier from japan (needed an adapter for the plug but not important).... the JBL speakers are amazing, but i lost the center speaker and sub woofer during mymove back to the states and i needed something less expensive that would compliment the JBLs for surround sound. And this thing kicks... maybe not quite as crystal clear, but the range and raw output far outway the minor difference in sound. (without lisening just for that you'd never know. Would buy more if i had more speaker outputs!! great buy, you won't be dissapointed i promise you that... Also don't be afraid to use some 14 gauge high end wire... that always helps aswell! my neighbors don't like it, but stuff happens ;)Thanks amazon. now i'm deaf. ;)",
    "overall": 5.0,
    "summary": "sick for the price! ...sick anyway,",
    "unixReviewTime": 1315958400,
    "reviewTime": "09 14, 2011"
  },
  {
    "reviewerID": "A82ZHT5OQS8CF",
    "asin": "B000EI0EB8",
    "reviewerName": "D. Jackson",
    "helpful": [
      2,
      3
    ],
    "reviewText": "I recently updated my computer sound system from the typical '$150 system in a box' setup to a standalone receiver with standard speakers.This Cerwin-Vega! obviously is the center channel in my new system. I'm impressed with the sound quality difference between my old Logitech G51 speakers and this new setup.I've been quite pleased with the clarity and response of this speaker. Vocals sound great and it puts out more bass than I expected.Take of that grill; the red rings on the speaker look fantastic and it certainly shouldn't hurt the sound to have one less thing between you and the speaker.For reference, here's my current setup:Computer outputting sound through an Audigy X-Fi gamer using 6-channel input to a:Yamaha HTR-6130BL 500 Watt 5.1-Channel Home Theater ReceiverBIC America DV62si Bookshelf Speakers (Pair, Black)(front left, front right)Cerwin Vega! VE-5C Center Channel Speaker(center)Yamaha NS-M225P Floorstanding Speakers (Pair)(rear left, rear right)Total cost for this system (considering sales/different locations for purchase) was about $530.When I move into my new house (finally escaping the apartment/duplex) thing I will add a subwoofer to the equation and we will *sing*.",
    "overall": 5.0,
    "summary": "Clear and precise at a great price.",
    "unixReviewTime": 1253664000,
    "reviewTime": "09 23, 2009"
  },
  {
    "reviewerID": "A3OB0LRLT6BYIG",
    "asin": "B000EI0EB8",
    "reviewerName": "Doxiemama11",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I've always owned Cerwin-Vega speakers for my home Audio systems.  These speakers (larger, commercial versions) are what dance clubs use!  Bose doesn't come close to the quality sound that CV delivers.  If you want a true audio experience, buy a CV speaker system.  Talk about 'rocking the house'?  These will rock not only your house, but the entire neighborhood!  Play \"We Will Rock You\" by Queen for a test.  I don't have to say anything more.  :P",
    "overall": 5.0,
    "summary": "Cerwin-Vega is no secret to me",
    "unixReviewTime": 1364342400,
    "reviewTime": "03 27, 2013"
  },
  {
    "reviewerID": "A142KAWI5ZOUZR",
    "asin": "B000EI0EB8",
    "reviewerName": "Elbow63",
    "helpful": [
      0,
      0
    ],
    "reviewText": "way beyond expectations!  it's not the best ever, but for the $$ it is tremendous.clarity is good, low end great, volume is awesome.have not heard anything comparable until you get up in the $400-$600 range.",
    "overall": 5.0,
    "summary": "woohoo!",
    "unixReviewTime": 1355097600,
    "reviewTime": "12 10, 2012"
  },
  {
    "reviewerID": "A2RAZ180DUTXMO",
    "asin": "B000EI0EB8",
    "reviewerName": "Emil",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Before I bought VE-5C , I went with a gigantic Pioneer center speaker and since it didn't fit under my TV, I decided to return and shop for small center channel. I gotta say this, I have never owned any Cerwin Vega speakers before, but I had heard the name when I was a kid, and I'm glad that I didn't forget the name. These speakers are brilliant, I couldn't believe how much sound I have missed before in a single movie....The definition and clarity of these speakers is second to none. I definitely recommend them to anyone who is on budget and want the biggest bang for the buck. Many many years ago I heard the name Cerwin Vega! Now I know where the fame was coming from....Pure sound quality and liveliness of the sound they reproduce!!!Kudos to you Cerwin Vega!",
    "overall": 5.0,
    "summary": "It is amazingly impressive",
    "unixReviewTime": 1390262400,
    "reviewTime": "01 21, 2014"
  },
  {
    "reviewerID": "A1HV2NJAWZI87Y",
    "asin": "B000EI0EB8",
    "reviewerName": "Emily Jones",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Nice speaker with quaility sound. The center channel goes well with my existing system.So far I haven't had any problems. Shipping was extreemly quick!!",
    "overall": 4.0,
    "summary": "Does the job",
    "unixReviewTime": 1362268800,
    "reviewTime": "03 3, 2013"
  },
  {
    "reviewerID": "ACIZII6JENNCY",
    "asin": "B000EI0EB8",
    "reviewerName": "Gabriel",
    "helpful": [
      1,
      1
    ],
    "reviewText": "It is great to hear all the dialog in movies and shows. This speaker sounds great and it doesn't disappear behind the rest of my home theater. I highly recommend it. It also looks understated and high quality.",
    "overall": 5.0,
    "summary": "Wonderful dialog",
    "unixReviewTime": 1327104000,
    "reviewTime": "01 21, 2012"
  },
  {
    "reviewerID": "A24NPCXSIC79UJ",
    "asin": "B000EI0EB8",
    "reviewerName": "garyb",
    "helpful": [
      6,
      6
    ],
    "reviewText": "I replaced my old center channel speaker with this one and am amazed at the quality of the sound. Both voice and music are like having the performers right in the room with you.For the price you can't go wrong.",
    "overall": 5.0,
    "summary": "completely lifelike",
    "unixReviewTime": 1309046400,
    "reviewTime": "06 26, 2011"
  },
  {
    "reviewerID": "A2OQNA92CTSCKV",
    "asin": "B000EI0EB8",
    "reviewerName": "gary giesel",
    "helpful": [
      1,
      25
    ],
    "reviewText": "i always liked Cerwin-Vega speakers but have not received ordered the 20th just ordered today not yet not yet looking foward for them",
    "overall": 1.0,
    "summary": "not recevied",
    "unixReviewTime": 1363737600,
    "reviewTime": "03 20, 2013"
  },
  {
    "reviewerID": "AQ3E2VTNX5GXG",
    "asin": "B000EI0EB8",
    "reviewerName": "Gizwinkus \"Gizwinkus\"",
    "helpful": [
      2,
      2
    ],
    "reviewText": "After much searching and researching online while trying to decide what type and brand of speakers to use for home theater use, I finally decided I didn't want to cut holes in the walls and or ceiling and selected this center channel speaker along with two pair of the Cerwin-Vega Ve-5 series  bookshelf speakers for surrounds (side and rear) based on the specifications and the fact that I already had a pair of Cerwin-Vega D-9 floor speakers I wanted to use for front left and right. I used hooks and eyes to hang the speakers in the appropriate places as recommended by the manual that came with my new Denon AVR-790 receiver. I'm convinced it would be hard to buy a better speaker without paying much more money for it and most of us would mot be able to hear the difference between the two. I spend more time listening to music than watching movies and the overall sound quality of my Cerwin-Vega system  is incredible for both. For me, this is the perfect center channel speaker. Your results will vary depending on the qualities of the rest of your system. Personally, I love it.",
    "overall": 5.0,
    "summary": "Cerwin-Vega Rocks!",
    "unixReviewTime": 1262995200,
    "reviewTime": "01 9, 2010"
  },
  {
    "reviewerID": "A3NUQ5C61CTK4E",
    "asin": "B000EI0EB8",
    "reviewerName": "greer1999",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Installed it with my other Cerwin-vega speakers and it works like a charm. I have a full theater system in my room now and it sounds fantastic, this was the last part of the speaker set I needed and it was an excellent choice.",
    "overall": 5.0,
    "summary": "Great",
    "unixReviewTime": 1366934400,
    "reviewTime": "04 26, 2013"
  },
  {
    "reviewerID": "A3QZZ1VOH6YMUT",
    "asin": "B000EI0EB8",
    "reviewerName": "H.J.",
    "helpful": [
      0,
      2
    ],
    "reviewText": "Speaker sounds good, it is a nice workable size for surroundings. packaging was in good shape when delivered but speaker had damage at top left corner; so I would say it came from the factory like that, with that said my plan of buying Cerwin-Vega towers and rear speakers for a upgrade has just ended.",
    "overall": 3.0,
    "summary": "Good sound",
    "unixReviewTime": 1387929600,
    "reviewTime": "12 25, 2013"
  },
  {
    "reviewerID": "A2J61B7SPHS5ZX",
    "asin": "B000EI0EB8",
    "reviewerName": "Ian Gibbons",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Good speaker worth the money, good for my &#34;normal person&#34; system. Like the looks of it and it sounds good with sports and music",
    "overall": 4.0,
    "summary": "I would buy another one in a heartbeat",
    "unixReviewTime": 1381017600,
    "reviewTime": "10 6, 2013"
  },
  {
    "reviewerID": "A2M7UWT3841T3S",
    "asin": "B000EI0EB8",
    "reviewerName": "IFUBIOK",
    "helpful": [
      3,
      8
    ],
    "reviewText": "There are several similar center speaker systems out there that I have not heard, but I bought this to replace my custom 2-way speaker box (which was part of a pair that I need to use elsewhere). I was hoping for matching sound quality and volume and was disappointed. My home built 2-way speaker box (4\" full + 2\" tweeter) had a crisper cleaner sound and was louder than this box. When I bumped up the dB level for the center speaker on my Onkio 7.1 system, the speaker became usable. I will keep it, but I was hoping for crisper voice dialogs!",
    "overall": 3.0,
    "summary": "Was hoping for a crisper/cleaner sound",
    "unixReviewTime": 1272240000,
    "reviewTime": "04 26, 2010"
  },
  {
    "reviewerID": "A3GDMJPXGJ4NH",
    "asin": "B000EI0EB8",
    "reviewerName": "Irving Boyce-el",
    "helpful": [
      0,
      0
    ],
    "reviewText": "PRISTINE SOUND NEED I SAW MORE OH YEAH THE BASS MADE ME GO BUY THE REST OF THE SURROUND SOUND CERWIN VEGA SYSTEM  HMMMMM MIGHT GET THE SUB WOOFER ALSO WE WILL SEE LOL",
    "overall": 5.0,
    "summary": "GREAT SOUND CV HAS ALWAYS BEEN A LEADER IN AUDIO SOUND",
    "unixReviewTime": 1372204800,
    "reviewTime": "06 26, 2013"
  },
  {
    "reviewerID": "A3RG4F8XP4SML3",
    "asin": "B000EI0EB8",
    "reviewerName": "Jah",
    "helpful": [
      0,
      1
    ],
    "reviewText": "This speaker really stands out in the room. Your gonna see it and you gonna here it. Totally meets the standard.",
    "overall": 4.0,
    "summary": "Another good buy.",
    "unixReviewTime": 1299369600,
    "reviewTime": "03 6, 2011"
  },
  {
    "reviewerID": "A31IMT4QWTT3OR",
    "asin": "B000EI0EB8",
    "reviewerName": "James J. Kane",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I have two Cerwin Vega VE-5Cs that are used as B main/front speakers. My A speakers are two Cerwin Vega VE-12s and they sound GREAT, and the Cerwin Vega VE-5Cs speakers sound great, and make the pictures on the wall vibrate and move. I really like the VE-5C speakers and want to add three more of them to my system, but the price has gone up twenty dollars per speaker or sixty dollars.............................................",
    "overall": 5.0,
    "summary": "I Love Cerwin Vega",
    "unixReviewTime": 1327881600,
    "reviewTime": "01 30, 2012"
  },
  {
    "reviewerID": "A38V9DUTUG4L8A",
    "asin": "B000EI0EB8",
    "reviewerName": "James O. Merritt",
    "helpful": [
      3,
      10
    ],
    "reviewText": "I just bought a new 50 in Plasma TV. The sound from the tv itself is louses. I am building my own  sound system. I just added the Cerwin Vega! VE-5C Center Speaker. It has really enhanced my sound system for the money I paid for it, It is a great little speaker for it's price. I will later add a Cerwin Vege Sub-wolfer to my unit.",
    "overall": 4.0,
    "summary": "WRITTEN BY JIM MERRITT",
    "unixReviewTime": 1191542400,
    "reviewTime": "10 5, 2007"
  },
  {
    "reviewerID": "AIV7ZG68SDY2C",
    "asin": "B000EI0EB8",
    "reviewerName": "jcg",
    "helpful": [
      1,
      1
    ],
    "reviewText": "My first center, this was a real good price at $70 new. Always liked cerwin.  It sounds good fits under my tv.  no complaints and its really clear with voices and music.  i have pretty good speakers to begin with so there werent really any holes in the mids, but this made the mids a little clearer and fuller. definitely would recommend them to anyone looking for a cheap but good center (beats the hell out of those HTIB centers)",
    "overall": 5.0,
    "summary": "Awesome Center Channel",
    "unixReviewTime": 1315872000,
    "reviewTime": "09 13, 2011"
  },
  {
    "reviewerID": "A2CEDB78M9PYGH",
    "asin": "B000EI0EB8",
    "reviewerName": "Jeff \"Jeff\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I have this right underneath my TV and attached to my Onkyo DSP 5.1 surround system. Its sound and looks great. I have the front cover off to show off the red surround foam of the speakers which also add a touch of color to the black on black on black stero and tv and etc equipment of the entertainment center.",
    "overall": 5.0,
    "summary": "Great sound and very good looking center speaker",
    "unixReviewTime": 1387065600,
    "reviewTime": "12 15, 2013"
  },
  {
    "reviewerID": "A3C4TVRJ2DLKWJ",
    "asin": "B000EI0EB8",
    "reviewerName": "jeffrey p. kidd",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I bought this to replace my BIC America center channel & I was blown away by the dramatic differance in sound.The dialog is crystal clear.",
    "overall": 5.0,
    "summary": "Loud & Clear",
    "unixReviewTime": 1371859200,
    "reviewTime": "06 22, 2013"
  },
  {
    "reviewerID": "A34AH92AXWONG6",
    "asin": "B000EI0EB8",
    "reviewerName": "jeremy-faribault,mn",
    "helpful": [
      0,
      0
    ],
    "reviewText": "i have this paired up with the ve-5m surrounds and ve 3 way 12s and an infinity ps212 powered sub. great sound quality and the size is right too, not big and bulky. would recommend to anyone looking for a center channel.",
    "overall": 5.0,
    "summary": "perfect center channel speaker",
    "unixReviewTime": 1304985600,
    "reviewTime": "05 10, 2011"
  },
  {
    "reviewerID": "A2FQVIZ3D4CE24",
    "asin": "B000EI0EB8",
    "reviewerName": "JF",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This center speaker is a work horse as it delivers 150 watts of pure octave every time. Its an active speaker that enhances voice and treble. I've owned other brands but Cerwin Vega has got to be the best speakers thus far.",
    "overall": 5.0,
    "summary": "Awesome",
    "unixReviewTime": 1368489600,
    "reviewTime": "05 14, 2013"
  },
  {
    "reviewerID": "AW0E2PUBOD6CK",
    "asin": "B000EI0EB8",
    "reviewerName": "jfragland76",
    "helpful": [
      2,
      2
    ],
    "reviewText": "I guess I'm to be considered a newbie at home theater systems. For many years, loud and clear meant an awesome system to me. As I've gotten older(35), I've learned to respect a good sound and moreso what to listen for. This is my first attempt at home theater, which didn't come in a box, lol. My receiver is a Pioneer VSX-821, a Sony 12\" sub, 8\" Sony front towers, I haven't chosen any rears as of yet, and for the last month or so-this Cerwin Vega center channel. For the price(I gave $100 for mine here on Amazon), I'm very, very pleased. It has a good sound that I think the average person will be more than pleased with. Although if you know the sound you're looking for, you may want to shell out a few more bucks. Again, not taking anything at all away from the VE-5C, but it's really not the crisp sound I was hoping for. I wasn't really expecting the most awesome speakers ever made for $100 either-I just didn't want to be let down, and thankfully, I am not. I will run this center channel for a good while I imagine, until I get some rears and can start nit-picking, it will do just fine.So, all in all, if you're wanting thr crisp, clean, high-dollar sound, then-shell out the bucks. I am very pleased with spending $100 on this and was actually suprised with how good it did sound. If you're just wanting a good, cheap, center channel-I doubt that you'll be let down. Hope this review helps someone.",
    "overall": 4.0,
    "summary": "Very pleased, but....",
    "unixReviewTime": 1344470400,
    "reviewTime": "08 9, 2012"
  },
  {
    "reviewerID": "AE77NTBKJ45UV",
    "asin": "B000EI0EB8",
    "reviewerName": "joe",
    "helpful": [
      2,
      2
    ],
    "reviewText": "What can I say cerwin vega did great. Always do. For price can't beat it. I prefer klipsch center channel overall but you can never go wrong with this product would buy again any day",
    "overall": 5.0,
    "summary": "buy it you wont rgret it",
    "unixReviewTime": 1387152000,
    "reviewTime": "12 16, 2013"
  },
  {
    "reviewerID": "A1ZX0LF9Q4ZPNW",
    "asin": "B000EI0EB8",
    "reviewerName": "Joel snobohm",
    "helpful": [
      0,
      0
    ],
    "reviewText": "My old Sonys are now sold as this thing just took my surround sound to a whole new level. You can't go wrong with these.",
    "overall": 5.0,
    "summary": "Packs a punch",
    "unixReviewTime": 1366502400,
    "reviewTime": "04 21, 2013"
  },
  {
    "reviewerID": "A3A17M104Q794",
    "asin": "B000EI0EB8",
    "reviewerName": "John O. McCauley",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I've been upgrading the audio portion of my a/v system for some time;  right TV, right receiver, etc.  I have Bose 301s for the main right and left speakers, and they sound fabulous, whether watching movies, listening to the FM, or listening to old vinyl.  Still there was something missing.  This speaker more than fills a hole in my system.  It replaces a tiny Sony speaker, that, while adequate in many ways, was just not cutting it in the center.  I never realized how much I was missing until I got this CV.  It makes a HUGE difference.  And this speaker is a bargain at this price.  I've been pricing, and listening to, center speakers for a couple of months now, and just jumped on this one because of the price, sight unseen.  I have had Cerwin-Vega speakers before, but on a much larger scale.  I have a huge pair of CV speakers on another, analog-only system, that are well over 30 years old, and are in brand-new condition, after being used daily.  I was right to trust CV's quality.  You cannot possibly go wrong with this speaker, in THIS application.  A very first-rate center speaker!",
    "overall": 5.0,
    "summary": "Real inexpensive fix!!!",
    "unixReviewTime": 1304467200,
    "reviewTime": "05 4, 2011"
  },
  {
    "reviewerID": "A2IRXEN4UWOFDI",
    "asin": "B000EI0EB8",
    "reviewerName": "John Poole",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I bought it to replace an older dual 6.5 inch center channel, just for aesthetics, less noticeable, and expected to lose a little sound quality and efficiency, and was pleasantly surprised to experience a noticeable improvement in sound quality with no loss in efficiency, that's watts in vs volume out, for those less experienced with speakertalk. It's in a Yamaha powered 5.1 surround in a living room area that is actually part of an open floor plan house and it keeps up with 12&#34; 3 ways up front and 5.25&#34; 2  ways surrounds. A quality piece.",
    "overall": 5.0,
    "summary": "Small enclosure, Big sound",
    "unixReviewTime": 1393113600,
    "reviewTime": "02 23, 2014"
  },
  {
    "reviewerID": "A1XMYF8OC40T2",
    "asin": "B000EI0EB8",
    "reviewerName": "Jon Linville",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Perfect match for the VE series of Cerwin-Vega speakers.  This is so well matched with my CV tower speakers that you can't pinpoint the source of the sound when watching movies in digital format.",
    "overall": 5.0,
    "summary": "Great speaker!!",
    "unixReviewTime": 1385164800,
    "reviewTime": "11 23, 2013"
  },
  {
    "reviewerID": "A3R9X01EYECHKN",
    "asin": "B000EI0EB8",
    "reviewerName": "Joseph McCoy",
    "helpful": [
      0,
      2
    ],
    "reviewText": "Stole the speakers out of it to replace the mids in my Cerwin Vega MX-400s. I plan to blow them up as soon as I get this volume knob cranked to 10.",
    "overall": 4.0,
    "summary": "Nice for parts!",
    "unixReviewTime": 1366243200,
    "reviewTime": "04 18, 2013"
  },
  {
    "reviewerID": "A2J3SDOGKU2WTK",
    "asin": "B000EI0EB8",
    "reviewerName": "Joseph Straub",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Fantastic center channel! Brought my home theater to the next level. Amazing sound and clarity without breaking the bank..Thank you!",
    "overall": 5.0,
    "summary": "5 stars",
    "unixReviewTime": 1395878400,
    "reviewTime": "03 27, 2014"
  },
  {
    "reviewerID": "ATNOI7E8GTIVE",
    "asin": "B000EI0EB8",
    "reviewerName": "J. Ruvio \"KayakSurfer\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Purchased this speaker as a center channel for a rental unit.  Have had no complaints so far.  The speaker is quite heavy, a good sign for the speaker components.  Purchased in September of 2009 and still in use today.",
    "overall": 5.0,
    "summary": "Great Center Channel for rental unit",
    "unixReviewTime": 1309132800,
    "reviewTime": "06 27, 2011"
  },
  {
    "reviewerID": "ACJUPMQOU94H",
    "asin": "B000EI0EB8",
    "reviewerName": "jsasada81",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I am upgrading my HomeTheaterInABox system.  While these HTIB speakers are nice for entry level home theater systems, a movie lover will soon find them selves asking for more.  The little satillite speakers in the front and back hardly \"fill\" a larger room with the sound you are wanting.  Hence my purchase of the Cerwin Vega VE-5c.  If you are reading this, you obviously know how important the center channel is.  All I can say is \"wow\" what a difference this Cerwin Vega is over the smaller center channel speaker that came as part of the HTIB system.  If you are a movie lover, do yourself a favor and get a nice center channel like this one.  You will never look back.  I also bought new left and right channel speakers - I have the VE-5C matched with the Cerwin Vega VE-8F for the left and right channel.  WOW!  Amazing upgrade!",
    "overall": 5.0,
    "summary": "Nice nice nice sound!",
    "unixReviewTime": 1362787200,
    "reviewTime": "03 9, 2013"
  },
  {
    "reviewerID": "A33E4CTBSV54BT",
    "asin": "B000EI0EB8",
    "reviewerName": "JTCANADA \"Jack\"",
    "helpful": [
      2,
      3
    ],
    "reviewText": "This is a excellent entry level center speaker for the price.  I compared with lots of other similar but all with much highe price.  I am very happy with the purchase.",
    "overall": 5.0,
    "summary": "Great price for a good center speaker",
    "unixReviewTime": 1262563200,
    "reviewTime": "01 4, 2010"
  },
  {
    "reviewerID": "A2VDANJ78W74SK",
    "asin": "B000EI0EB8",
    "reviewerName": "keith amos",
    "helpful": [
      0,
      1
    ],
    "reviewText": "Size was perfect.  Needed to replace my much bigger cerwin Vega speaker due to building a new house and was afraid to mount the 22lb speaker on the wall.  This speaker is not as good as that one but its more than adequate.",
    "overall": 3.0,
    "summary": "Good",
    "unixReviewTime": 1387238400,
    "reviewTime": "12 17, 2013"
  },
  {
    "reviewerID": "ANWH51F8RFUA6",
    "asin": "B000EI0EB8",
    "reviewerName": "Keith R. Dulak",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Beautiful sound and style.  Hard pressed to find a better center channel speaker at this price.  Btw,  remove the cover.",
    "overall": 5.0,
    "summary": "perfect",
    "unixReviewTime": 1392854400,
    "reviewTime": "02 20, 2014"
  },
  {
    "reviewerID": "A1LZ84U5CUGBE3",
    "asin": "B000EI0EB8",
    "reviewerName": "Kent A. Miller",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Perfect for adding the center channel sound for a complete surround system using Cerwin Vega everything........Nice value for the money.  Happy Camper",
    "overall": 5.0,
    "summary": "Economically fantastic",
    "unixReviewTime": 1358899200,
    "reviewTime": "01 23, 2013"
  },
  {
    "reviewerID": "ATQXFJCKJQN46",
    "asin": "B000EI0EB8",
    "reviewerName": "Lazarus Dark \"My gun kata is greater than you...",
    "helpful": [
      2,
      2
    ],
    "reviewText": "I have this paired to the Dayton Audio 150 watt amplifierDayton APA150 150W Power Amplifier, which allows for a full 150 watts to one channel. It's a great pairing and I can never crank it past 50% or I'll go deaf. Even at high volumes though the sound is clean and crystal clear and precise. You won't believe the bass performance either, it will rattle my Wii sitting next to it right off the shelf during a few select movies (it did this during Watchmen on Bluray).My full system is: VE 15\" 3-ways as the front speakers with the 800 watt CV pro amp, VE-5M bookshelf speakers for the surrounds using an AudioSource amp, and two Dayton Audio 12\" Subwoofers. It's a killer system that shakes the foundation, and since all the VE series use the same tweeter, the speakers are voice matched, blending well. (Note: I'm using the analog outs on my HTPC straight to the amplifiers, I don't have a reciever)",
    "overall": 5.0,
    "summary": "Fantastic center, loud as you want it, the whole VE series is great",
    "unixReviewTime": 1250294400,
    "reviewTime": "08 15, 2009"
  },
  {
    "reviewerID": "A3XTNK2GFWJW",
    "asin": "B000EI0EB8",
    "reviewerName": "Leslie Latchman",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I bought these as my tweeters on my existing CLS 215 keeps blowing. It was cheaper to buy one of these boxces than to change the tweeter. I bought 4 and while they are satisfactory the tweeter is a bit low. However, they appear to handle the power better, but time will tell. The boxes are no good for base, there is none at all. Very good midrange.I reccommend these as support to your existing sysyem and not as stand alone speakers.",
    "overall": 3.0,
    "summary": "Cerwin Vega VE-5C 2 Way Home speakers",
    "unixReviewTime": 1378080000,
    "reviewTime": "09 2, 2013"
  },
  {
    "reviewerID": "A3FP97JP68BMBV",
    "asin": "B000EI0EB8",
    "reviewerName": "lj",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Nice center channel I think it sounds lots better than the bars people use. It cerwin vega as well im a fan of car and home speakers.Under 100 bucks you cant go wrong",
    "overall": 5.0,
    "summary": "Good center channel",
    "unixReviewTime": 1362182400,
    "reviewTime": "03 2, 2013"
  },
  {
    "reviewerID": "AEZAWUB14ICW8",
    "asin": "B000EI0EB8",
    "reviewerName": "lkjljlkj",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I own Klipsch speakers but needed a nice center speaker -- this one is great; especially for the price. Very nice.",
    "overall": 5.0,
    "summary": "Very nice at this price point",
    "unixReviewTime": 1365292800,
    "reviewTime": "04 7, 2013"
  },
  {
    "reviewerID": "A3CIDX5LRGIJD0",
    "asin": "B000EI0EB8",
    "reviewerName": "Marjor",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Snap these up while you still can.  Sound is great and the price and quality are unbeatable!  Hookup was easy, as well.",
    "overall": 5.0,
    "summary": "Great speakers for the price",
    "unixReviewTime": 1403222400,
    "reviewTime": "06 20, 2014"
  },
  {
    "reviewerID": "A15TT4PA4Q2U5B",
    "asin": "B000EI0EB8",
    "reviewerName": "maurice jenjins",
    "helpful": [
      0,
      0
    ],
    "reviewText": "this speaker delivered just what was promised quality voice reproduction and was it clear. woooooow. every thing i hoped for and more",
    "overall": 4.0,
    "summary": "great!!!",
    "unixReviewTime": 1380672000,
    "reviewTime": "10 2, 2013"
  },
  {
    "reviewerID": "AEFVHPV86MPAQ",
    "asin": "B000EI0EB8",
    "reviewerName": "michael",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This fixed my problem with hearing voice. I recently bought 2 CV-12'S for my front speakers and moved old towers behind me for surround. It sounded great for sound effects and music but I couldn't hear talking or singing. I asked a friend who knows stereos and he said to get a center speaker. I bought this one and love my surround sound now. Rattle the whole house and can hear everything perfectly!",
    "overall": 5.0,
    "summary": "Fixed my problem with voice.",
    "unixReviewTime": 1395964800,
    "reviewTime": "03 28, 2014"
  },
  {
    "reviewerID": "A2Z1L7ZNJK4HIG",
    "asin": "B000EI0EB8",
    "reviewerName": "Michael Witt",
    "helpful": [
      0,
      0
    ],
    "reviewText": "MATCHED THIS WITH THE ENTIRE VE SERIS AND THIS WAS TRUELY THE MISSING GEM. EVERYTHING I THROW AT THIS SPEAKER IT HANDLES WITH EASE. BEST BANG FOR YOUR BUCK.",
    "overall": 5.0,
    "summary": "GREAT SOUND GREAT COMPANY",
    "unixReviewTime": 1391904000,
    "reviewTime": "02 9, 2014"
  },
  {
    "reviewerID": "A2GUK6IX4PS3GY",
    "asin": "B000EI0EB8",
    "reviewerName": "M. Rockert \"rocco13\"",
    "helpful": [
      1,
      1
    ],
    "reviewText": "I bought a box surround sound about five years ago,junk. I've been saving up for new stuff and the center speaker was the last thing to buy. The first stereo system I bought back in the seventies, my speakers were Cerwin-Vega, best I've ever owned. Never thought I could afford them again until I saw them on Amazon, it was cheaper than direct from the company. I love it. The sound is so clear and crisp, don't have to have the sound turned up so loud now to hear the voices. What a difference, and the price was great too!",
    "overall": 5.0,
    "summary": "Always a favorite",
    "unixReviewTime": 1247788800,
    "reviewTime": "07 17, 2009"
  },
  {
    "reviewerID": "A1L2QFFZHC8MU5",
    "asin": "B000EI0EB8",
    "reviewerName": "Mrs \"New Mum\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This is my first cerwin-vega speaker, and for the money it is excellent! I'll be adding some floor standing cerwin-vegas soon. This speaker was the finishing touch to my 5.1 (soon to be 7.1) set up. Dialogue is loud and crisp and it's a nice size to fit in a standard media console.",
    "overall": 5.0,
    "summary": "Great speaker for the money!",
    "unixReviewTime": 1360627200,
    "reviewTime": "02 12, 2013"
  },
  {
    "reviewerID": "A3SOVGNRTGMNQX",
    "asin": "B000EI0EB8",
    "reviewerName": "N David",
    "helpful": [
      3,
      3
    ],
    "reviewText": "I did a lot of research before choosing this speaker.  Despite audiophiles not recommending it, I chose it because of its compact size, the enthusiastic videos online showing it's base capabilities, and the positive reviews on Amazon.com.  The speaker is replacing the centre channel of my Fluance AVHTB+ sound system.  I needed a small centre channel and this Cerwin Vega met the size requirements.  It's powered by my Onkyo TX-SR606 receiver.  I immediately noticed an improvement in vocals and base after hooking it up.  Vocals were clearer and the base was not muddy like the Fluance centre channel.  After running the Audyssey speaker setup on my Onkyo and watching various DVD's, I am very pleased with its sound quality.  The enclosure is well build, heavy, and the finish looks identical to my Fluance enclosures.  My only complaint is the box terminals, which are spring clips.  I think Cerwin Vega should have used all metal speaker terminals.  Overall, I highly recommend this as a quality entry-level speaker for those who aren't audiophiles.",
    "overall": 5.0,
    "summary": "Excellent sounding centre channel speaker",
    "unixReviewTime": 1360713600,
    "reviewTime": "02 13, 2013"
  },
  {
    "reviewerID": "A3IP4QTI2TSHI5",
    "asin": "B000EI0EB8",
    "reviewerName": "N. R. Caldwell \"nrc\"",
    "helpful": [
      2,
      4
    ],
    "reviewText": "For years I've had problems getting enough volume out of my center channel and surrounds.  I have a set of ancient but still wonderful Cerwin Vega D3s in the front and my smaller speakers just couldn't match the volume level without constantly tweaking the mix.  By refreshing my surround setup with this VE-5C along with the VE series rear and sub channels the whole system is now wonderfully balanced.  This center provides such full, rich sound for dialog that I'd love to use it for my TV audio even when I'm not running my full surround setup.",
    "overall": 5.0,
    "summary": "Finally a center channel that can  keep up",
    "unixReviewTime": 1309651200,
    "reviewTime": "07 3, 2011"
  },
  {
    "reviewerID": "AR0AT8GFOCVGT",
    "asin": "B000EI0EB8",
    "reviewerName": "Paul Hartley",
    "helpful": [
      0,
      0
    ],
    "reviewText": "While looking for inexpensive speakers for my home theater surround sound system, I came across this one. It is well built, very attractive, and produces awesome sound to the less than perfect hearer. It fits well on my TV stand and I would purchase this speaker again. Add to this the awesome service of Amazon, and you can't lose.",
    "overall": 5.0,
    "summary": "Good Purchase",
    "unixReviewTime": 1390608000,
    "reviewTime": "01 25, 2014"
  },
  {
    "reviewerID": "A1MY4Q3NK7CF9W",
    "asin": "B000EI0EB8",
    "reviewerName": "Peter Luke Alexander",
    "helpful": [
      0,
      0
    ],
    "reviewText": "There is a reasonable amount of centre speakers out there in the market; but not many with this price tag and performance.It does what it was designed to and built nice.I was quite surprised to see how well the speaker was finished and how it performed once I had it hooked up.It can take a lot of high volumes and the vocals coming through are crisp and clear.It has Value for the cost of purchase.It can also run as surrounds if you bought a pair.Please note it is not a high end product and should not be compared with one.it has its own independent lure and should be appreciated that way.Buy it and you will enjoy it for what its potential is.",
    "overall": 5.0,
    "summary": "Cerwin-Vega VE-5C 2-Way Center Channel Speaker",
    "unixReviewTime": 1363564800,
    "reviewTime": "03 18, 2013"
  },
  {
    "reviewerID": "A3UHINVC6A1X4P",
    "asin": "B000EI0EB8",
    "reviewerName": "Ryan McCartney \"Go Saints!!!\"",
    "helpful": [
      10,
      11
    ],
    "reviewText": "If you are looking for a best bang for your buck deal this will be a great find for you. Has good weight to it nice and is very sturdy. The highs are not very very crisp but do sound pretty good. Since a center channel is mostly for dialog this will not hurt your sound quality anyway. You need a center that can play the right bass tones in voices that is loud enough to keep up with your other surround sound speakers. I have 2 three way Sony floor standing speakers piggy backed meaning running with two satellite speakers for my front channels. This is a total of 12 speakers for my fronts. I have two three ways for my rear and a 12\" Sub that holds the low end very well. I bought this to replace my center channel that just could not keep up during my movies. I did not want to spend a ton since I have spent quite a bit already. This was a great buy and I would recommend it to anyone. This center truly made the difference in my movies making my system sound pretty close to theater loud. I only have to turn my unit up to about 1/3 of the way up to get you jumping out of your seat and if it's music you will have ringing in your ears about 1 hour in. This speaker is exactly what I thought it would be a little workhorse that brought good power back to the dialogue of my system. If you bought a satellite system this is a great upgrade to round out the system. A satellite center channel is not going to give you what you need they are too small to reproduce room filling voices for music or movies. Two things are always needed first when buying a home theater system. 1st a good or decent center 2nd good or decent sub without those your system will always sound weak. If you do have a satellite center you can try conecting both I did now I have the very crisp highes and rich mid to lows. This Vega would do fine on it's own though but if you have the set up for it why not use both right. BE WARNED THIS IS BIGGER THAN IT LOOKS!!! check the measurements given they are correct.You can check out the pics I posted to better understand my setup.My system....Samsung 52\" 120hz LCDTechnics 500w Receiver (old school but still bumps all night)Harmon Kardon 3 way Satellites (front,center,and rear)Cerwin Vega 3 way center (being reviewed here)Sony 3 way 8\" floor standing speakers also in frontHarmon Kardon 12\" down fire subwoofer (room shaker for real)PS3",
    "overall": 5.0,
    "summary": "Great deal for the price.",
    "unixReviewTime": 1265068800,
    "reviewTime": "02 2, 2010"
  },
  {
    "reviewerID": "A1GB6GKFXLF8IT",
    "asin": "B000EI0EB8",
    "reviewerName": "Scott D. Degeorge \"scodge\"",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I have the comeplete system of the v-series cerwin vega's I purchased the fronts first and was impressed by the bass and clarity , so I picked up the surrounds a while later and the center channel last . I couldn't be happier with price and overall performance of these speakers . If you're gonna pay for a name make it Cerwin vega .I recently moved and dropped the center channel speaker and now it's a bit rumbly I emailed customer service at Cerwin and now I'll find out how good their service is I hope it's as good as their speakers",
    "overall": 5.0,
    "summary": "ve-5c perfect",
    "unixReviewTime": 1269820800,
    "reviewTime": "03 29, 2010"
  },
  {
    "reviewerID": "A394N30OI279N6",
    "asin": "B000EI0EB8",
    "reviewerName": "Shane Wisecup",
    "helpful": [
      0,
      0
    ],
    "reviewText": "This is an awesome piece to a sound system that is classic quality you would expect from cerwin vega very happy.",
    "overall": 5.0,
    "summary": "Fantastic sounds",
    "unixReviewTime": 1403654400,
    "reviewTime": "06 25, 2014"
  },
  {
    "reviewerID": "A3CNRGVF8CVGTS",
    "asin": "B000EI0EB8",
    "reviewerName": "STEPHAN",
    "helpful": [
      1,
      2
    ],
    "reviewText": "I LIKE THIS CENTER SPEAKER BUT I ONLY HAVE ONE INFERIOR SPEAKER TO COMPARE IT TO. THE CENTER SPEAKER OFTEN CARIES MOSTLY THE VERBAL CONTENT OF A MOVIE DEPENDING ON THE SOUND TRACK FORMAT, THX, PL2X, ALL SPEAKER STEREO, AND SO ON. MY AV SYS. HAS 8 SPEAKERS INCLUDING A PAIR OF FRONT CHNL. JBL MODEL L20T STUDIO MONITORS THAT REALY SEEM TO PUSH MOST OF THE SOUND, BUT WITH THE CV CENTER I HAVE HAD NO PROBLEM WITH HEARING THE SPOKEN WORD AT ALL THEY SEEEM TO WORK WELL. I ALSO USE CV FOR MY REAR SPEAKERS AND ONKIO R&L;  CENTRAL AND ONKIO SUB., I DO NOT LIKE THE ONKIO SUB. BUT ALL OF THE CV ARE FINE. THE JBL'S WERE MORE $ THEN THE REST AND SOUND THAT WAY.S",
    "overall": 4.0,
    "summary": "ICANT COMPARE TO OTHERS.",
    "unixReviewTime": 1336176000,
    "reviewTime": "05 5, 2012"
  },
  {
    "reviewerID": "A2PEYTK6U17U0Q",
    "asin": "B000EI0EB8",
    "reviewerName": "Susie P.",
    "helpful": [
      0,
      0
    ],
    "reviewText": "Amazing center channel.  I run 100 watts to this speaker and it handles it well.  I have it competing with large floor speakers and it has no problem keeping up.  Great highs, great sound.  Was kind of upset that it was not made in usa. Still a 5 star as its miles better than my previous center.",
    "overall": 5.0,
    "summary": "What can i say, its cerwin vega",
    "unixReviewTime": 1397001600,
    "reviewTime": "04 9, 2014"
  },
  {
    "reviewerID": "A3T6VAOIXYNASL",
    "asin": "B000EI0EB8",
    "reviewerName": "Tim Cady",
    "helpful": [
      0,
      0
    ],
    "reviewText": "I was looking for a new center speaker because the one I had seem a little under powered for dialogue..This definitely puts the vocal up front, in fact I had to turn down the db setting on my AVR to make it more uniformed.,I was really wanting the highly reviewed Polk CS10 but it was too wide for my setup. Im pleased so far- this is just in a room thats only 12'x8'.  Powered an Onkyo AVR HT-RC430 that only pushes 65 watts per channel. The other Speakers in this setup are some old sony bookshelfs (MB 105's) for my fronts,  Polk 10\" Subwoofer  (PSW10) , And the Dayton Audio b652 for my rears.The sound is warm not crisp but I prefer that. I think if your in the market for a center that is under 18 Inches this is a solid choice.Not sure if I'd choose this for my Living Room Center-- But for a small room that I cant really crank it up anyway-- it sounds great..Side Note for my setup I have my crossover on my AVR set to 100 Hz and it sounds great.Update..Just uploaded 2 pics of the speaker..",
    "overall": 4.0,
    "summary": "So Far So Good In my ManCave",
    "unixReviewTime": 1364256000,
    "reviewTime": "03 26, 2013"
  },
  {
    "reviewerID": "A1CE4T3AP28FJS",
    "asin": "B000EI0EB8",
    "reviewerName": "Tim",
    "helpful": [
      1,
      1
    ],
    "reviewText": "Works well in the space I needed it to work in.  I had purchased a low-profile entertainment center and needed a small center speaker to fit it in.  Works great!",
    "overall": 5.0,
    "summary": "Good quality sound.",
    "unixReviewTime": 1302134400,
    "reviewTime": "04 7, 2011"
  }
]